import 'package:flutter/material.dart';
import 'package:varadvani/l10n/app_localizations.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class OtherDepartmentsScreen extends StatelessWidget {
  const OtherDepartmentsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(
        title: AppLocalizations.of(context)!.other_departments,
      ),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                _buildMainText(
                  'भागवत औषधालय',
                  'सद्गुरू श्रीसाईनाथ महाराज जडीबुटी देऊन लोकांच्या व्याधींचे निवारण करायचे. त्यांच्या या कृतीचे स्मरण म्हणून गोरट्यात औषधालय स्थापन करण्याची श्रीदासगणू महाराजांची इच्छा होती. ती पूर्ण करण्याच्या हेतूने व गोरटे परिसरातील ग्रामस्थांना आयुर्वेदिक उपचार उपलब्ध व्हावेत यासाठी पू. अप्पांनी प्रतिष्ठानच्या आवारात “भागवत औषधालय” सुरु केले आहे. येथे परंपरागत आयुर्वेदिक उपचार अगदी नाममात्र शुल्कात उपलब्ध केले जातात. विविध उत्सवासाठी येणाऱ्या भाविकांचीही त्यामुळे मोठी सोय होते. गोरटे आणि आजूबाजूच्या गावातील मंडळीही त्याचा लाभ घेत असतात.',
                ),
                _buildMainText(
                  'वरद चिंतनिका',
                  'श्रीदासगणू महाराज व स्वामी वरदानंद भारती यांच्या ग्रंथांचं वाचन, चिंतन करण्यासाठी ‘संजीवन’ या स्मृतिदालनातच सुसज्ज वाचनालयाची सोय उपलब्ध केली आहे. या अभ्यासिकेला “वरद चिंतनिका” असे म्हटले आहे. ही चिंतनिका अद्ययावत आसन व्यवस्थेने सुसज्ज आहे. चिंतनिकेत प. पू. दादांच्या व प. पू. अप्पांच्या ग्रंथसंपदेसोबतच प्राचीन वैदिक वाङ्मयापासून आधुनिक सकल संतसाहित्यापर्यंत अनेक ग्रंथ उपलब्ध करुन देण्याची योजना केली आहे. जेणेकरुन आपल्या सर्व प्रश्नांची उकल या ठिकाणी करुन घेता येईल. त्याचा साधकांनी व जिज्ञासूंनी जास्तीत जास्त लाभ करुन घ्यावा हीच अपेक्षा आहे.',
                ),
                _buildMainText(
                  'ग्रंथविक्री केंद्र',
                  'श्रीदासगणू महाराज व स्वामी वरदानंद भारती यांची प्रकशित झालेली सर्व ग्रंथसंपदा, त्यांच्या कीर्तनाच्या ऑडिओ/व्हिडीओ सिडीज, इतर लेखकांनी त्यांच्यावर लिहिलेली पुस्तके यांच्या विक्रीसाठी एक सुसज्ज दालन स्वतंत्ररित्या उभे केले आहे. श्रीवरदनारायण, पू. दादा व पू. अप्पा यांची विविध प्रकारची चित्रेही या केंद्रावर उपलब्ध आहेत.',
                ),
                _buildMainText(
                  'गोशाळा',
                  'श्रीदासगणू महाराज आयुर्वेदाचे पुरस्कर्ते होते तर प. पू. अप्पा स्वतः आयुर्वेदिक वैद्य होते. त्यामुळे उभयतांना गोरसाचे अनन्यसाधारण महत्व ज्ञात होते. गोरट्याला प्रतिष्ठान आकाराला येत असताना भारतीय वाणाच्या गोवंश वृद्धीचा विचार होवून गोशाळा उभारण्यात आली. आज रोजी प्रतिष्ठानच्या या गोशाळेत ८० च्या जवळपास गायी व त्यांची वासरे आनंदाने नांदत आहेत. प्रतिष्ठानच्या गोरसाची सर्व मागणी त्यातून सहजतेने पूर्ण होते. तेथील सेवेकरी निष्ठापूर्वक त्या सर्व गोधनाची सर्वतोपरी काळजी घेत असतात.',
                ),
                _buildMainText(
                  'ज्वलनशील वायू निर्मिती यंत्रणा',
                  'प्रतिष्ठानकडे असलेल्या गोधनातून मोठ्या प्रमाणात दररोज गोमय (शेण) उपलब्ध होत असते. याचा योग्य विनियोग करण्याच्या दृष्टीने प्रतिष्ठानच्या बागेत ज्वलनशील वायू निर्मितीचे यंत्र (Bio Gas Plant) कार्यान्वित केले आहे. यामुळे उपलब्ध होणाऱ्या सर्व शेणाचा योग्य वापर होवून प्रतिष्ठानच्या दैनिक वापरासाठी लागणाऱ्या ज्वलनशील वायूची सर्व मागणी अनायासे पूर्ण होते. या प्रक्रियेतून उरलेल्या शेणाचा पुन्हा खत म्हणून वापर होतो. या सर्व पर्यावरणपूरक यंत्रणेमुळे उत्तम बचत होत असून पर्यावरणाच्या संवर्धनासाठी हा प्रतिष्ठानचा एक प्रयत्न असून पर्यावरणचा ऱ्हास रोखण्याच्या दृष्टीने एक लक्षणीय उपक्रम आहे.',
                ),
                _buildMainText(
                  'भावोद्यान (दुर्मिळ वृक्ष संवर्धन)',
                  'प्रतिष्ठानच्या उपलब्ध असलेल्या जागेत कदंब, अर्जुन, रुद्राक्ष, बेल, अशोक, बकुळ, चाफा, आवळा हे व यासारखे अनेक दुर्मिळ वृक्ष मिळवून त्यांची लागवड केली आहे. त्यांचे काळजीपूर्वक संवर्धनही केले जाते. आयुर्वेदिक औषधी वनस्पतींचेही संवर्धन केले जाते.',
                ),
                _buildMainText(
                  'दामोदर वाटिका (पुष्पोद्यान)',
                  'प्रतिष्ठानच्या मागील बाजूस असलेल्या जागेत विविध फुलझाडांची लागवड केली असून दररोजच्या पूजेसाठी अनेक प्रकारची, अनेक रंगांची, विविध आकाराची तजेलदार, सुगंधित पुष्पे विपुल प्रमाणात उपलब्ध होतात.',
                ),
                _buildMainText(
                  'मानस विहार',
                  'आवश्यक त्या सर्व सोयींनी युक्त असलेल्या खोल्यातून साधनेसाठी आलेल्या भाविकांची व्यवस्था येथे केली आहे. उत्सवकाळात हजारो भाविक येतात; त्यांच्या जेवणाच्या पंगतींची व्यवस्था येथेच केली जाते. यासाठी मागील बाजूला मोठे स्वयंपाकघर तयार केले आहे.',
                ),
                _buildMainText(
                  'पू. अप्पांच्या निवासाची खोली',
                  'मानस विहाराच्या मागील बाजूस पू. अप्पांच्या निवासाची खोली आजही जतन करून ठेवली आहे. गोरट्यात असताना याच खोलीत पू. अप्पांचा निवास असायचा. या खोलीत पू. अप्पांच्या नित्यवापरातील वस्तू काळजीपूर्वक जतन करून ठेवल्या आहेत. पू. अप्पांच्या अभ्यासातील व वाचनातील विविध विषयांवरील अनेक ग्रंथही जतन करून ठेवले आहेत. या खोलीत पू. अप्पांचे अतिशय सुंदर चित्र विराजमान आहे. येथे दररोज सकाळी ०५:३० वाजता पू. अप्पांचे पूजन केले जाते. पू. अप्पांचे दर्शन घेऊन या खोलीतील दिव्य व परम शांतीचा अनुभव घेऊन भाविक आत्यंतिक समाधानाने नतमस्तक होतात.',
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }

  Widget _buildMainText(String title, String text) {
    return Column(
      spacing: 10,
      crossAxisAlignment: CrossAxisAlignment.center,
      children: [
        Text(
          title,
          textAlign: TextAlign.center,
          style: TextStyle(
            fontSize: 20,
            fontFamily: 'Mukta',
            fontWeight: FontWeight.bold,
            color: Color(ColorCode.black),
            letterSpacing: 0,
            height: 1.5,
          ),
        ),
        Text(
          text,
          style: TextStyle(
            fontSize: 18,
            fontFamily: 'Mukta',
            color: Color(ColorCode.black),
            letterSpacing: 0,
            height: 1.5,
          ),
        ),
      ],
    );
  }
}
