import 'package:flutter/material.dart';
import 'package:varadvani/l10n/app_localizations.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class ParamparaRakshanScreen extends StatelessWidget {
  const ParamparaRakshanScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(
        title: AppLocalizations.of(context)!.heritage_preservation,
      ),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  'श्रीमद्सद्गुरू श्रीदासगणू महाराज प्रतिष्ठान तर्फे साजऱ्या होणाऱ्या उत्सव-महोत्सवांत अध्यात्मिक क्षेत्रात नावाजलेल्या अधिकारी सत्पुरुषांची प्रवचने, सामाजिक क्षेत्रात भरीव योगदान देणाऱ्या मान्यवरांची व्याख्याने, उत्तम कीर्तनकारांची रसाळ कीर्तने यांची रेलचेल असते. साधकांना, भाविकांना यांतून आवश्यक ते मार्गदर्शन नेमकेपणाने व सहजतेने मिळत असते. हे सर्व उत्सव-महोत्सव अत्यंत सात्विक, उल्हासपूर्ण व भक्तिमय वातावरणात संपन्न होत असतात. वेळेचे बंधन काटेकोरपणे पाळले जाते; नव्हे ‘वेळेचे बंधन’ ही दासगणू परिवाराची एक विशेष ओळख बनली आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'सदाचार-सन्नीती-सद्वासना या कल्याणकारी सद्गुणांची प्रेरणा देणारे कार्यक्रम या संतभूमीत येऊन सर्व भाविक अनुभवतात. स्वतःचे नि:श्रेयस व अभ्युदय साधण्यासाठी व जीवन उन्नत करून घेण्यासाठी सर्वच कार्यक्रमांना भाविकांचा उदंड प्रतिसाद असतो. या सर्व उत्सव-महोत्सवात व इतर वेळी काही वैशिष्ट्यपूर्ण परंपरा पाळल्या जातात, नावीन्यपूर्ण उपक्रम राबविले जातात. अशा काही वैशिष्ट्यपूर्ण परंपरा व नावीन्यपूर्ण उपक्रमांची माहिती येथे दिली आहे.',
                ),
                _buildUtsav(
                  '(१) संतांचे प्रतीकात्मक पूजन : ',
                  'श्रीज्ञानेश्वर महाराज (कार्तिक वद्य त्रयोदशी), श्रीतुकाराम महाराज (तुकाराम बीज), श्रीरामदास स्वामी (दासनवमी), श्रीएकनाथ महाराज (नाथषष्ठी), सद्गुरू श्रीवामनशास्त्री (ज्येष्ठ वद्य एकादशी) या संतांच्या पुण्यस्मरणाच्या दिवशी एका अधिकारी महात्म्याला निमंत्रित करून त्या त्या संतांच्या ठायी त्यांना मान देऊन त्यांचे त्या संताच्या रूपात विधिवत पूजन केले जाते.',
                ),
                _buildUtsav(
                  '(२) प्रभात फेरी : ',
                  'संतांच्या जयंती अथवा स्मरण उत्सवात सकाळी ६ वाजता प्रभात फेरी काढली जाते. पहाटेपासूनच सडा-सारवण, रांगोळ्या काढून, तोरणे लावून या फेरीच्या स्वागताची तयारी केली जाते. पहाटेच्या प्रसन्न वेळी जमलेली भाविक मंडळी शुचिर्भूत होऊन सकल संतांचा जयघोष करीत, संतांचे अभंग म्हणत व नामाचा गजर करीत नेमून दिलेल्या मार्गाने शिस्तबद्ध पदक्रमण करीत प्रभात फेरी पूर्ण करतात. श्रीरामनवमी, श्रीतुकाराम महाराज (तुकाराम बीज), श्रीरामदास स्वामी (दासनवमी), श्रीएकनाथ महाराज (नाथषष्ठी), श्रीदासगणू महाराज जयंती (पौष शुद्ध एकादशी), स्वामी वरदानंद भारती (श्रावण वद्य त्रयोदशी) यांच्या उत्सवात ही प्रभात फेरी काढली जाते.',
                ),
                WidgetHelper.buildNormalText(
                  'गोरटे येथे सद्गुरू श्रीदासगणू महाराजांच्या जयंती उत्सवात (पौष शुद्ध एकादशी) रात्री ९ च्या पाठानंतर श्रीदादांच्या पालखीची मिरवणूक काढण्यात येते. या पालखीच्या वेळी गोरटे ग्रामस्थांचा उत्साह इतका दांडगा असतो आणि श्रीदादांवर इतकी श्रद्धा असते की या पालखीला मंदिरात परत येण्यास मध्यरात्रीचे दोन वाजतात.',
                ),
                _buildUtsav(
                  '(३) कावडी समर्पण : ',
                  'श्रीरामनवमीच्या दिवशी श्रीरुक्मिणीपांडुरंगाला व सद्गुरू श्रीदासगणू महाराजांच्या जयंती उत्सवात (पौष शुद्ध एकादशी) श्रीदादांच्या समाधीला कावडी समर्पण हे मुख्य आकर्षण असते. गोरटे व परिसरातील भाविक आठ किमी अंतरावरून श्रीदासगणू महाराजांना प्राणप्रिय असलेल्या गोदावरी नदीवर रात्री जाऊन गोदाजल घेऊन येतात. सकाळी त्या तीर्थाची गावातून मिरवणूक काढण्यात येते. मंदिराच्या दारात प्रमुख कावडी धारकांचे पाद्यपूजन होऊन कावडी समर्पणाला सुरुवात होते. अगदी ५/६ वर्षाच्या बालकांपासून ते मध्यमवयीन व वयस्कर असे १५० ते २०० भाविक श्रद्धापूर्वक गोदातीर्थ कावडीतून घेऊन येतात व त्या जलाने अभिषेक करतात. प्रत्येक कावडी धारकाला नंतर प्रसाद देण्यात येतो. गोदास्तोत्र, श्रीजगन्नाथ पंडित रचित गंगालहरी यांचे पठण यावेळी केले जाते. हा सर्व सोहळा अत्यंत भावपूर्ण वातावरणात संपन्न होतो. स्वतः श्रीदासगणू महाराजांनी श्रीरामनवमीच्या उत्सवात शिर्डी येथे श्रीसाईबाबांच्या समाधीला कावडी समर्पणाचा उपक्रम सुरु केला होता. यासाठी शिर्डीपासून ११ किमी अंतरावर असलेल्या कोपरगावातून वाहणाऱ्या गोदावरीचे जल ते स्वतः घेऊन येत असत. आजही शिर्डीला श्रीरामनवमीच्या उत्सवात गोदातीर्थाच्या कावडी समर्पणाचा उपक्रम उत्साहाने संपन्न होत असतो.',
                ),
                _buildUtsav(
                  '(४) ध्वजारोहण : ',
                  'गोरट्याच्या समाधी मंदिरावर भगवा ध्वज डौलाने निरंतर फडकत असतो. तथापि वाऱ्यामुळे व वातावरणातील बदलामुळे हा ध्वज दर २/३ महिन्यांनी बदलावा लागतो. हा विचार करून पू. अप्पांनी ध्वज बदलण्यासाठी (१) श्रीराम नवमी (२) गुरुपौर्णिमा (३) दसरा व (४) जयंती उत्सवातील मुख्य दिवस असे चार दिवस नेमून दिले आहेत. साधारण २/३ महिन्यांनी हे दिवस येतात. यातूनही पू. अप्पांची सूक्ष्म निरीक्षणशक्ती प्रत्ययास येते. ध्वज कसा असावा याचेही सुस्पष्ट निर्देश पू. अप्पांनी लिहून ठेवले आहेत. त्यानुसार पांढरे जाड सुती कापड घेऊन ते कावेमधे शिजवून वाळविले जाते. त्यावर सोनेरी चमकीच्या कापडाने ‘ॐ श्री 卐’ तयार करून शिवून, ध्वज तयार केला जातो. जमलेले सर्व भाविक ध्यानमंदिरातील प्रार्थनेनंतर या ध्वजारोहणाच्या कार्यक्रमासाठी गच्चीवर जमा होतात. उगवत्या सूर्यनारायणाच्या साक्षीने मंत्रोच्चारात प्रतिष्ठानच्या पदाधिकाऱ्यांच्या शुभहस्ते ध्वजारोहण करण्यात येते. या प्रसन्न वेळी ‘बुद्धी प्रकाशित करी आमुची तमारी’ हे पू. अप्पांनी रचलेले ‘श्रीसूर्यनारायणस्तोत्र’ सामूहिक स्वरात म्हणले जाते. सर्व संतांच्या नामाचा जयघोष केला जातो. “विठ्ठल विठ्ठल म्हणा की आनंदाने, वैकुंठी लाविली ध्वजा सकल संतांने” हे भजन उच्च स्वरात म्हणले जाते.',
                ),
                _buildUtsav(
                  '(५) तुकाराम बीज : ',
                  'हा उत्सव अनोख्या पद्धतीने साजरा केला जातो. गोरटे व परिसरातील गावकरी आपापल्या घरातून भाकरी व चटणी करून आणतात. प्रतिष्ठानच्या वतीने आमटी भात व गावकऱ्यांच्या सर्व भाकऱ्या एकत्रित करून श्रींना नैवेद्य दाखविला जातो व त्या भाकऱ्या प्रसाद म्हणून सर्व उपस्थित भाविकांना दिल्या जातात. या प्रसादाची चव अत्यंत न्यारी व आकर्षक असते, हे सांगायलाच नको!',
                ),
                _buildUtsav(
                  '(६) शुद्ध एकादशीला श्रीगीतापाठ : ',
                  'दशमी, एकादशी व द्वादशी असे तीन दिवस रोज सहा अध्याय याप्रमाणे प्रत्येक शुद्धातल्या एकादशीला श्रीमद्भगवद्गीतेचा पाठ केला जातो. गीताजयंतीला (मार्गशीर्ष शुद्ध एकादशी) संपूर्ण गीतापाठ केला जातो.',
                ),
                _buildUtsav(
                  '(७) दीपोत्सव : ',
                  'श्रीदासगणू महाराजांच्या जयंतीवर्षाच्या संख्येइतके दिवे रात्रभर तेवत ठेवणे, हा एक अनोखा उपक्रम पू. अप्पांनी कार्यवाहीत आणला. श्री दादांच्या जयंती उत्सवात दशमीच्या रात्री हे दिवे प्रज्वलित करून संपूर्ण रात्र व एकादशीच्या पहाटेपर्यंत ते तेवत राहतील याची दक्षता घेतली जाते. यासाठी भाविकांना १-१ तास वाटून दिला जातो. भाविक मंडळी आनंदाने हे दायित्व स्वतःकडे घेतात व श्रीविष्णुसहस्रनामाचे पाठ म्हणत हे दिवे रात्रभर तेवत राहतील याची काळजी घेतात. शके १९३९ या वर्षी संपन्न झालेल्या १५० व्या जयंती उत्सवात दरवर्षीच्या रिवाजाप्रमाणे १५० दिवे रात्रभर तेवत ठेवले होते. श्रीरामनवमी व श्रीतुकाराम बीज या उत्सवातही हा दीपोत्सव याचप्रमाणे साजरा केला जातो.',
                ),
                _buildUtsav(
                  '(८) महाशिवरात्र : ',
                  'समाधी मंदिरासमोर श्रीरुक्मिणीपांडुरंगाची व श्रीमहादेवाची स्थापना स्वतः श्रीदासगणू महाराजांनी केली आहे. माघ वाद्य त्रयोदशी अर्थात महाशिवरात्रीचा पर्वकाळ येथे मोठ्या भक्तिभावाने संपन्न होतो. महाशिवरात्रीच्या दिवशी सकाळच्या आरतीनंतर पू. अप्पांनी केलेल्या शिवमहिम्नस्तोत्राच्या ओवीबद्ध अनुवादाचे सामुदायिक वाचन केले जाते. मूळचे शिवमहिम्नस्तोत्र खूपच भावपूर्ण, रसाळ व परिणामकारक आहे. या रसाळ व परिणामकारक शिवमहिम्नस्तोत्राच्या भाषेचा जो कठीणपणा जनसामान्यांसाठी आहे, तो पू. अप्पांनी त्याचा ओवीबद्ध अनुवाद करून दूर केला आहे. मूळ स्तोत्रातील भाव व गेयतेला जराही बाधा न आणता त्यांनी त्यात सुलभता आणली आहे. कोणत्याही प्रकारच्या भांड्यातून घेतलेले भागीरथीचे जल शुद्ध व पवित्रच असते, तसे या स्तोत्राच्या भाषेत पालट झाला तरी त्यातील भावार्थ टिकून आहे, असे अनुवादित स्तोत्रातील उपसंहाराच्या ओव्यांमध्ये पू. अप्पांनी म्हटले आहे. या स्तोत्राचा पू. अप्पांनी केलेला अनुवादही तितकाच भावपूर्ण, रसाळ व परिणामकारक आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'दुपारच्या वेळी कीर्तनाचा कार्यक्रम असतो. प्रघात व परंपरा म्हणून श्रीदासगणू महाराजांनी रचलेले “श्रीधनेश्वर” हेच आख्यान सांगितले जाते. रात्रीच्या पाठानंतर श्रीमहादेवाला अभिषेक केला जातो. त्यावेळी ब्रह्मवृंदाच्या समुदायाकडून रुद्राची ११ आवर्तने केली जातात. तसेच भाविकांच्या उपस्थितीत श्रीशिवमहिम्नस्तोत्राचीही ११ आवर्तने केली जातात. त्यानंतर श्रीदासगणू महाराजांनी रचलेली विविध ज्योतिर्लिंगांची स्तोत्रे सामुदायिक सुरात अत्यंत मधुरतेने म्हणली जातात. रात्री १२ वाजता श्रीमहादेवाची आरती व प्रसाद वाटप होऊन कार्यक्रम संपन्न होतो. चतुर्दशीच्या दिवशी सकाळी साडेसहा वाजता श्रीमहादेवाचे पूजन करून दहीभाताचा नैवेद्य अर्पण केला जातो व आरती केली जाते.',
                ),
                _buildUtsav(
                  '(९) आषाढी एकादशी : ',
                  'वारकरी संप्रदायामध्ये आषाढी एकादशीचे अनन्यसाधारण महत्त्व आहे. “सर्व सुखाचे आगर” असलेल्या “बाप रुक्मादेवीवर” श्रीपांडुरंगाच्या केवळ दर्शनाच्या अभिलाषेने देहू-आळंदी येथूनच नव्हे तर महाराष्ट्राच्या कानाकोपऱ्यातून वारकरी पालखी घेऊन लाखोंच्या संख्येने या दिवशी भूवैकुंठ अशा पंढरपुरी येतात. गोरट्यातही या दिवशी पंचक्रोशीतील भाविकांची मोठी गर्दी उसळते. उमरी येथून भाविक मंडळी नामाच्या गजरात ती. दादांच्या पादुकांची दिंडी घेऊन येतात. दिवसभर साधना करून कीर्तनश्रवणाचा लाभ घेतात. आषाढी एकादशीच्या पावन दिवशी पंढरपूरला जाऊन विठूमाऊलीचे दर्शन घेता आले नाही तरी गोरट्यात गुरुमाऊलीच्या दर्शनाने ‘त्याच’ अपूर्व आनंदाचा आस्वाद घेऊन भाविक तृप्ततेने आपापल्या गावी परतात.',
                ),
                _buildUtsav(
                  '(१०) गुरुपौर्णिमा : ',
                  'हा दिवस गोरटे येथे अत्यंत उत्साहात संपन्न होतो. पू. अप्पांनी रचलेल्या “श्रीसद्गुरूषोडशोपचार पूजा” चे सर्व भाविक सामुदायिक पठण करून श्रीसद्गुरूंची अर्चना करतात. त्यानंतर श्रीपांडुरंग, श्रीरुक्मिणी, श्रीवरदनारायण व सर्व संतांच्या प. पू. अप्पांनी रचलेल्या संस्कृत स्तोत्रांचे सामुदायिक पठण होते. परिवारातील अनुग्रहित सदस्य आपापल्या घरी व शक्य झाल्यास आपापल्या गावी “श्रीसद्गुरूषोडशोपचार पूजा” सामुदायिकपणे करतात.',
                ),
                _buildUtsav(
                  '(११) श्रीकृष्णकथामृताचे पारायण : ',
                  'श्रीदासगणू महाराजांच्या आदेशाने व त्यांच्याच शुभाशीर्वादाने पू. अप्पांनी वयाच्या तिसाव्या वर्षी भगवान श्रीकृष्णाच्या जीवन चरित्रावर दोहा-चौपाईच्या धाटणीमध्ये मराठीत “श्रीकृष्णकथामृत” हे महाकाव्य रचले आहे. या अनुषंगाने एक आठवण सांगावीशी वाटते. पुढे संन्यासदीक्षा घेतल्यानंतर पू. अप्पांची पुणे आकाशवाणीने एक मुलाखत घेतली होती. त्यात त्यांना विचारण्यात आले, “तुम्ही आतापर्यंत भरपूर वाङ्मयाची निर्मिती केली आहे. त्यात आता काही बदल करावासा वाटतो का?” क्षणाचाही विलंब न करता पू. अप्पा “नाही” म्हणाले. कुमार वयातच दृढ झालेली पू. अप्पांची स्थितप्रज्ञता यावरून प्रत्ययाला येते.',
                ),
                WidgetHelper.buildNormalText(
                  'चित्ताकर्षक व चपखल उपमांनी ओतप्रोत भरलेले रसाळ, मधाळ, प्रासादिक असे “श्रीकृष्णकथामृत” हे महाकाव्य मराठी सारस्वताला लाभलेली एक मोठी देणगीच आहे. पू. अप्पांनी याच्या पारायणाच्या घालून दिलेल्या पद्धतीनुसार नागपंचमी (श्रावण शु. पंचमी) ते गोकुळाष्टमी (श्रावण व. अष्टमी) या दरम्यान १८ सर्ग असलेल्या या ग्रंथाचे विवेचनासहित वाचन केले जाते. गोकुळाष्टमीच्या दिवशी ग्रंथाच्या पारायण समाप्तीच्या निमित्ताने भगवान श्रीकृष्णजन्माचा सोहळा मोठ्या उत्साहाने साजरा केला जातो. केवळ गोरट्यातच नव्हे तर परिवारातील भाविक आपापल्या घरीही या प्रासादिक ग्रंथाचे पारायण करून भगवान श्रीकृष्णाच्या कृपाशीर्वादाला पात्र होत असतात.',
                ),
                _buildUtsav(
                  '(१२) यतिपूजन : ',
                  'गुरुपौर्णिमा, अनंतचतुर्दशी (पू. अप्पांचा जन्मदिवस), चैत्र वद्य ११ (पू. अप्पांची दीक्षाग्रहण तिथी) व श्रावण वद्य १३ (पू. अप्पांची समाधी तिथी) या दिवशी यतिपूजन केले जाते. सर्व भक्तांच्या वतीने परिवारातील एका जोडप्याला पू. अप्पांच्या यतिपूजनाचा मान दिला जातो. पू. अप्पांनी जेथे देहविसर्जन केला त्या भागीरथीच्या पावन तीरावर वसलेल्या उत्तरकाशी क्षेत्रीही पू. अप्पांचे यतिपूजन केले जाते. विशेषतः अनंतचतुर्दशीला उत्तरकाशी येथे मोठा उत्सव साजरा केला जातो.',
                ),
                _buildUtsav(
                  '(१३) श्रीरुक्मिणीपांडुरंग स्थापना वर्धापन दिन : ',
                  'ती. दादांच्या उपस्थितीत शके १८७२ च्या (इ. स. १९५०) फाल्गुन वद्य एकादशी या तिथीला श्रीरुक्मिणीपांडुरंगाची गोरट्यात प्रतिष्ठापना झाली असल्याने हा दिवस “वर्धापन दिन” म्हणून साजरा केला जातो. या दिवशी श्रीरुक्मिणीपांडुरंगाला अभिषेक केला जातो. पू. अप्पांनी रचलेल्या ‘श्रीपांडुरंगाष्टक’ व ‘श्रीरुक्मिणीअष्टक’ यांचे सामुदायिक पठण केले जाते.',
                ),
                _buildUtsav(
                  '(१४) एकादशीचे भजन : ',
                  'गोरट्यातील भजनी मंडळ प्रत्येक एकादशीला श्रीदादांच्या समाधीसमोर भजनाची सेवा सादर करतात. रात्री १० वाजता सुरु झालेले भजन उत्तरोत्तर रंगत जाऊन रात्री १:३० वाजता संपते. काही वेळा हे भजन इतके रंगात येते की भजन संपायला पहाटेचे ३:३० वाजतात. निस्वार्थ भावाने भजनी मंडळ आपली सेवा सादर करतात. भावपूर्ण व मनापासून केल्या जाणाऱ्या या भजनाची गोडी अवीट असते. नामाच्या गजरात भजनी मंडळ दंग होऊन जातात. बऱ्याचदा गोरटे गावाच्या आजूबाजूच्या गावातूनही भजनी मंडळ आपली सेवा सादर करायला येतात.',
                ),
                _buildUtsav(
                  '(१५) वार्षिक व अर्धवार्षिक सभा : ',
                  'जयंती उत्सवात, पौष शु. ११ या दिवशी “वार्षिक सर्वसाधारण सभा” संपन्न होते तर गुरुपौर्णिमेच्या दिवशी “अर्धवार्षिक सर्वसाधारण सभा” संपन्न होते. या सर्वसाधारण सभेत सर्व भाविकांना सहभागी होता येते. प्रतिष्ठानच्या विश्वस्त मंडळींच्या उपस्थितीत प्रतिष्ठानच्या अध्यक्षांच्या नियंत्रणाखाली या सभा संपन्न होतात. मागील ६ महिन्यांत प्रतिष्ठानच्या वतीने राबविलेल्या उपक्रमांची माहिती, संपन्न झालेल्या उत्सवाचा तपशील, नवीन पुस्तकांचे प्रकाशन, प्रकाशित झालेल्या पुस्तकांचा आढावा, प्रकाशित होऊ घातलेल्या पुस्तकांची माहिती, विशेष घटनांची नोंद असा एकत्रित अहवाल सभेपुढे मांडला जातो. पुढील काळात होणाऱ्या उपक्रमांची, शिबिरांची व उत्सवांची माहिती उपस्थित भाविकांना दिली जाते. भाविकांना सूचना प्रकट करता येतात व योग्य सूचनांची दखलही घेतली जाते.',
                ),
                _buildUtsav(
                  '(१६) पाठांतर स्पर्धा : ',
                  'पू. दादा व पू. अप्पा यांनी आशयघन, प्रासादिक, हृदयाचा ठाव घेणारे विपुल काव्यभांडार आपणासाठी उपलब्ध करून दिले आहे. ते काव्य पुढच्या पिढीपर्यंत पोचावे, त्यांना त्याची गोडी लागावी या उद्देशाने (१) १ली ते ४थी (२) ५वी ते ८वी (३) ९वी ते १२वी (४) खुला गट अशा चार गटात पाठांतर स्पर्धा जयंती उत्सवाच्या आधी घेतली जाते. पू. दादा व पू. अप्पा यांची विविध स्तोत्रे, श्लोक, पोवाडे, कविता व दीर्घकाव्ये पाठांतरासाठी दिली जातात. जयंती उत्सवात निकाल जाहीर होऊन बक्षीसे वितरित केली जातात.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/chagan_kaka.png',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'पू. दादा यांची बहुतेक सर्व कीर्तने व पू. अप्पा यांचे बहुतेक सर्व काव्य ज्यांना मुखोद्गत होते व ज्यांनी आपल्या गोड आवाजाने परिवारातील तीन पिढ्यांना कीर्तनात गायनाची अत्यंत अनुकूल साथ केली त्या वै. छगनकाका बारटक्के यांच्या स्मृतिप्रीत्यर्थ पाठांतर स्पर्धेची बक्षिसे दिली जातात.',
                ),
                _buildUtsav(
                  '(१७) मेधावी पुरस्कार : ',
                  'ग्रामीण भागातील हुशार विद्यार्थ्यांचे कौतुक व्हावे व त्यातून इतर विद्यार्थ्यांना प्रोत्साहन मिळावे या हेतूने उमरी तालुक्यातून शालान्त परीक्षेत प्रथम क्रमांकाने उत्तीर्ण होणाऱ्या विद्यार्थ्याचा पाच सहस्र रुपयांचा “मेधावी पुरस्कार” देऊन गौरव करण्यात येतो. पू. अप्पांच्या स्मरण महोत्सवात हा पुरस्कार प्रदान केला जातो.',
                ),
                Align(
                  alignment: Alignment.centerLeft,
                  child: Text(
                    '(१८) संस्कृत भाषा प्राविण्य पुरस्कार :',
                    textAlign: TextAlign.start,
                    style: TextStyle(
                      fontSize: 18,
                      fontFamily: 'Mukta',
                      fontWeight: FontWeight.bold,
                      color: Color(ColorCode.black),
                      letterSpacing: 0,
                      height: 1.5,
                    ),
                  ),
                ),
                _buildShlokaWithMeaning(
                  shloka:
                      'तावदेषा देवभाषा देवि स्थास्यति भूतले l यावच्चवंशोsस्त्यार्याणां तावदेषा ध्रुवंध्रुवा ll',
                  explanation:
                      'ही देववाणी संस्कृतभाषा, या भूतलावर तोपर्यंत धृवपदासारखी (अढळ) अस्तित्वात राहील, जोवर आर्यांचा (सभ्य-सुसंस्कृत लोकांचा) अखेरचा वंशज या भूतलावर असेल !',
                ),
                _buildUtsav(
                  '‘भाषासु मुख्या मधुरा, दिव्या गीर्वाणभारती’',
                  ' अशा देवभाषा संस्कृतचे संवर्धन व्हावे या हेतूने दासगणू परिवारातील सदस्यांचे जे पाल्य संस्कृत भाषा विषयात १००% गुण मिळवितात त्यांचा अकराशे रुपयांचा “संस्कृत भाषा प्राविण्य पुरस्कार” देऊन गौरव करण्यात येतो. हा पुरस्कार जयंती उत्सवातील वार्षिक सभेत प्रदान केला जातो.',
                ),
                _buildUtsav(
                  '(१९) अध्यात्मिक शिबिरे : ',
                  'संतांच्या पावन स्पर्शाने पुनीत झालेल्या संतांच्या “पुण्यक्षेत्री मार्गक्रमण” करून त्या ठिकाणी निवासी शिबिरे आयोजित करणे, हे श्रीदासगणू प्रतिष्ठानचे एक प्रमुख व वैशिष्ट्यपूर्ण कार्य आहे. संतांच्या पुण्यक्षेत्री जाऊन तेथे ज्ञानेश्वरी, गाथा, दासबोध, भक्तीलीलामृत, भक्तीसारामृत, संतकथामृत, श्रीगुरुचरित्रसारामृत, श्रीशंकराचार्य चरित्र, उपनिषदर्थ कौमुदी, ब्रह्मसूत्रार्थ दर्शिनी, अनुवाद ज्ञानेश्वरी यांसारख्या धार्मिक ग्रंथांचे पारायण, प्रवचने, व्याख्याने, कीर्तने व संतपूजन असे या निवासी अध्यात्मिक शिबिरांचे स्वरूप असते. भाविकांचा अशा शिबिरांना उदंड प्रतिसाद लाभतो. कालडी (केरळ), शृंगेरी (कर्नाटक), वाराणसी (उत्तर प्रदेश), उत्तरकाशी (उत्तराखंड) या परराज्यातील तीर्थक्षेत्रांच्या ठिकाणांसह महाराष्ट्रातील पंढरपूर, आळंदी, देहू, सज्जनगड, शिवथर घळ, पैठण, नेवासा, आपेगाव, शिखर शिंगणापूर, शिर्डी, शेगाव या तीर्थक्षेत्री प्रतिष्ठानने आजतगायत अशी निवासी अध्यात्मिक शिबिरे अत्यंत भक्तीभावपूर्ण वातावरणात यशस्वीरीत्या संपन्न केली आहेत.',
                ),
                _buildUtsav(
                  '(२०) युवा शिबीर : ',
                  'ज्यांना अजून स्वतःचा भविष्यकाळ घडवायचा आहे, देशाचा येणारा भावी काळ ज्यांच्या हाती असणार आहे त्या तरुण पिढीवर सुयोग्य संस्कार होणे अत्यंत गरजेचे आहे. त्या तरुण पिढीचा आजचा पाया देव, धर्म आणि राष्ट्र या त्रिसूत्रींच्या उत्कर्षाच्या ध्येयाने प्रेरित होऊन यांच्या भक्तीने परिपोषित झाला म्हणजे ही संस्कारक्षम पिढी राष्ट्राला वैभवाच्या शिखराकडे सहजपणे घेऊन जाईल, असा विश्वास प. पू. अप्पांना होता. तेव्हा या तरुण पिढीची योग्य-अयोग्य, चांगले-वाईट, कर्म-अकर्म यांतील नेमका फरक करून देणारी विवेकबुद्धी योग्यवेळी पुष्ट करून देणे, याचे दायित्व राष्ट्रहिताची चिंता वाहणाऱ्या प्रत्येकाचे आहे, या जाणिवेतूनच तरुण पिढीचे योग्य प्रबोधन व्हावे, त्यांची विचारक्षमता वृद्धिंगत व्हावी, त्यांच्या विचाराच्या कक्षा रुंदाव्यात, सद्सद्विवेक बुद्धीची जोपासना व्हावी या हेतूने प्रतिष्ठान दोन वर्षांतून एकदा केवळ युवकांसाठी युवा शिबिराचे आयोजन करीत असते. या युवा शिबिराला परिवारातील व परिवाराबाहेरील युवकांचा उत्तम प्रतिसाद असतो. या युवा शिबिरातून भविष्यकाळ घडविण्याची अनमोल शिदोरी मिळते, या स्वरूपाच्या प्रतिक्रिया शिबिरार्थी व्यक्त करतात.',
                ),
                _buildUtsav(
                  '(२१) हीच गुरुपूजा खरी : ',
                  'पू. अप्पांनी समाधी घेण्यापूर्वी एक काव्य लिहून ठेवले आहे. त्यात ते म्हणतात….',
                ),
                Text(
                  'मी म्हणजे ना शरीर l मी मद्ग्रंथांचा संभार ll \nत्याचे वाचन चिंतन l यथाशक्ती आचरण ll \nहीच गुरुपूजा खरी l नीट धरावे अंतरी ll',
                  textAlign: TextAlign.center,
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'पू. अप्पांचा हा आदेश कार्यवाहीत आणण्यासाठी प्रतिष्ठानने “हीच गुरुपूजा खरी” हा महत्वाचा उपक्रम सुरु केला आहे. या उपक्रमाच्या योजनेनुसार पू. अप्पांचे आशयघन, पथदर्शक व साधनेला अनुकूल पाठबळ देणारे विविध ग्रंथ वाचन व चिंतनासाठी ठेवले असून त्यांवर प्रश्नपत्रिका काढल्या आहेत. भाविकांनी अभ्यास करून विचारलेल्या प्रश्नांची उत्तरे लिहून प्रतिष्ठानकडे पाठवायची आहेत. तज्ञ व्यक्ती या उत्तरपत्रिका तपासून देतात. यानिमित्ताने साधकांचा या ग्रंथांचा सखोल अभ्यास व्हावा व त्यानुरूप आचरण होऊन जीवनाचे इप्सित साध्य व्हावे जेणेकरून पू. अप्पांना अभिप्रेत असलेली ‘खरी गुरुपूजा’ शिष्यांकडून घडावी, हा या उपक्रमाचा उद्देश आहे. १० वर्षांचा हा उपक्रम असून सर्व प्रश्नपत्रिका समाधानकारक सोडविणाऱ्या साधकाला प्रतिष्ठानच्या वतीने सन्मानपत्र देऊन गौरविले जाते. बरेच भाविक या उपक्रमाचा लाभ घेतात.',
                ),
                Text(
                  'll न लोभ दुसरा, घडो गुरुपरंपरा रक्षण ll',
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.orange),
                    letterSpacing: 0,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }

  Widget _buildUtsav(String title, String description) {
    return WidgetHelper.buildRichText(
      title,
      description,
      TextStyle(
        fontSize: 18,
        fontFamily: 'Mukta',
        fontWeight: FontWeight.bold,
        color: Color(ColorCode.black),
        letterSpacing: 0,
        height: 1.5,
      ),
      TextStyle(
        fontSize: 18,
        fontFamily: 'Mukta',
        color: Color(ColorCode.black),
        letterSpacing: 0,
        height: 1.5,
      ),
    );
  }

  Widget _buildShlokaWithMeaning({
    required String shloka,
    required String explanation,
  }) {
    return Column(
      spacing: 15,
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Text(
          shloka,
          textAlign: TextAlign.center,
          style: TextStyle(
            fontSize: 18,
            fontFamily: 'Mukta',
            fontWeight: FontWeight.bold,
            color: Color(ColorCode.black),
          ),
        ),
        WidgetHelper.buildRichText(
          'अर्थात, ',
          explanation,
          TextStyle(
            fontSize: 18,
            fontFamily: 'Mukta',
            color: Color(ColorCode.black),
            fontWeight: FontWeight.bold,
            letterSpacing: 0,
            height: 1.5,
          ),
          TextStyle(
            fontSize: 18,
            fontFamily: 'Mukta',
            color: Color(ColorCode.black),
            letterSpacing: 0,
            height: 1.5,
          ),
        ),
      ],
    );
  }
}
