import 'package:flutter/material.dart';
import 'package:varadvani/l10n/app_localizations.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class SanjeevanScreen extends StatelessWidget {
  const SanjeevanScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: AppLocalizations.of(context)!.sanjivan),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  'श्रावण वद्य एकादशी हा दिवस आपणा सर्वांसाठी अतिशय महत्वाचा, सणाचा आणि अभिमानाचा आहे. कारण प. पू. अप्पा स्वत: या दिवसाचे वर्णन “भाग्याचा आणि जीवनाच्या सार्थकाचा” असं करतात. याच दिवशी प. पू. अप्पांनी श्रीनारायणाच्या दिव्य आणि मृदु वरदहस्ताचा पावन स्पर्श अनुभवला. त्या अलौकिक स्पर्शसुखाची ओढ प. पू. अप्पांना अशी लागली की त्यानंतर वाटायचं की कधी एकदा परत श्रीनारायणाच्या कुशीत शिरता येईल कायमचं! आणि योग असा की श्रावण वद्य एकादशी याच दिवशी प. पू. अप्पांनी “नारायणापायी मिठी” दिली आणि प. पू. अप्पा नारायणस्वरुप झाले! “नर करणी करे तो नर का नारायण हो जाए” हे प. पू. अप्पांनी पुन्हा शब्दश: सिध्द केलं आणि प. पू. अप्पांनी संजीवन समाधी घेतली!',
                ),
                WidgetHelper.buildNormalText(
                  'खरं तर सर्व भारतवर्षासाठी हा दिवस अत्यंत अभिमानाचा अणि गौरवाचा! पण दासगणू परिवारात या अभिमानासोबतच एक विलक्षण पण अत्यंत स्वाभाविक व्याकुळता पसरली. आपल्या सद्गुरुंचं सामर्थ्य पाहून आदर, अभिमान, समाधान, आश्चर्य, रोमांच असे अनेक भाव दाटले. पण या सर्वांवर मात केली ती श्री सद्गुरुंच्या वियोगाच्या व्याकुळतेने! आता तो प्रेमळ आश्वासक स्पर्श, तो “नारायण” उच्चारुन दिलेला  आशीर्वाद, ते प्रसन्न दर्शन, तो विलक्षण सहज, खेळकर व मार्गदर्शक सहवास, ते सगुण सामिप्य आता नाही हा विचारच असह्य होता.',
                ),
                WidgetHelper.buildNormalText(
                  'आपणा सर्वांची अशी अवस्था होणार हे जाणवल्यानेच प. पू. अप्पांनी लिहून ठेवले “मी म्हणजे ना शरीर l मी मद्ग्रंथांचा संभार l” आणि खरोखरच प. पू. अप्पांचं वाङ्मय अभ्यासताना त्यांच्याच सहवासात असल्यासारखं वाटतं! पण हे कितीही खरं असलं तरी प्रत्येकाला सगुणाचीच ओढ असते हे वादातीतच! अगदी श्रीतुकोबारायसुध्दा म्हणतात, “तुका म्हणे माझे हेची सर्वसुख l पाहीन श्रीमुख आवडीने ll” तर तिथे आपणासारख्या सामान्यांची काय कथा? म्हणूनच प. पू. अप्पांची सगुणभेट याही पुढे गोरठ्याला कशी होईल? असा विचार झाला. प. पू. दादांच्या समाधी व्यतिरिक्त, गोरठ्याला दुसरे पूजास्थान नसावे हा प. पू. अप्पांचाच आदेश! त्यामुळे मग “स्मृती-दालना”ची संकल्पना पुढे आली. प. पू. अप्पांचे शब्दबद्ध जीवनचरित्र “तेजाचं चांदणं” आकार घेतच होतं. त्याचप्रमाणे प. पू. अप्पांच्या उपलब्ध असलेल्या अनेकानेक छायाचित्रांच्या सहाय्याने त्यांचा संपूर्ण दृष्य जीवनपट तयार करण्याचा विचार पुढे आला अणि स्मृतीदालनाने आकार घ्यायला सुरुवात केली. बघता बघता श्रीराधादामोदर वाटिकेच्या पूर्व भागात “संजीवन” उभे राहिले. दालन उभे राहण्यासाठी “अनंत हस्ते” मदत आली आणि आपणा सर्वांसाठी एक अनमोल ठेवा, एक कृतार्थ व परिपूर्ण तसेच आदर्श जीवन जणू आपल्यासाठीचं “संजीवन” आपल्याला मिळालं!',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/sanjeevan.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  '“संजीवन” कडे जाताना दुतर्फा उत्तमोत्तम रोपे, फुलझाडे जणू पुढे मिळणाऱ्या आनंदाची नांदीच देतात. दालनाच्या भव्य प्रवेशद्वारातून आत डोकावताच लेकुरवाळ्या श्रीपांडुरंगाचं मनोहारी दर्शन होतं. हा लेकुरवाळा विठोबा आपल्या लेकरांना, प. पू. दादा आणि प. पू. अप्पांना जणू कडेवर घेऊन उभा आहे असंच वाटतं. श्रीपांडुरंग, प. पू. दादा आणि प. पू. अप्पा हेच आपलं अधिष्ठान. त्यांच्या चरणावरती लीन होऊन दालनाच्या डाव्या बाजूने जाताना प. पू. अप्पांच्या जीवन चरित्राची सुरुवात होते.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/sanjeevan_1.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'प. पू. दादांची, शेवटच्या श्वासापर्यंत सेवा करणाऱ्या आणि प. पू. अप्पांसारखे नररत्न जन्माला घालणाऱ्या दामूअण्णा आणि राधामाय, यांची चित्ररुप भेट घडते, “दामूने मला पुढे आणले” असे प्रेमळ आणि सार्थ उद्गार प. पू. दादांनी ज्यांच्याबद्दल काढले तेच हे दामूअण्णा! असे कळताच त्यांचे छायाचित्र उपलब्ध करुन देणाऱ्या विज्ञानाला शतश: धन्यवाद द्यावे वाटतात. ओठांवर, श्री दामूअण्णांनी स्वरबध्द केलेल्या आणि श्रीदासगणू महाराजांच्या कीर्तन परंपरेतील कीर्तनाची रसाळ नांदी आणि प्रार्थना असलेल्या “रामदास माय माझी” या ओळी आपसुक येतात आणि पाऊल कष्टाने पुढे घ्यावे लागते.',
                ),
                WidgetHelper.buildNormalText(
                  'प. पू. अप्पांचा पाळणा गोदामाईला अर्पण केल्याचा प्रसंग, प. पू. दादांकडून (श्रीदासगणू महाराजांकडून) “श्रीविष्णुसहस्रनामाचे” मिळालेले साधन असे प्रसंग दृष्टीपुढे उभे राहतात. विद्यार्थी दशेतील तसेच गृहस्थाश्रमात नुकतेच प्रवेशलेल्या प. पू. अप्पांच्या तरुण, तेजस्वी आणि करारी मुद्रा हृदयाचा ठाव घेतात. पदवीदान समारंभ असो किंवा प्राचार्यांच्या कार्यालयात असो; धोतर, कोट आणि टोपी या पारंपरिक भारतीय वेषात दिसणाऱ्या प. पू. अप्पांच्या मुद्रा, स्वधर्म, स्वभाषा आणि स्वसंस्कृतीबद्दलचा आदर आणि आग्रह आपणाला अंतर्मुख करतात.',
                ),
                WidgetHelper.buildNormalText(
                  'आयुर्वेद महाविद्यालयाचे प्राचार्यपद भूषविणाऱ्या प. पू. अप्पांनी, श्रीदासगणू महाराजांची परंपरा समर्थपणे सांभाळली, अधिक वैभवाप्रत नेली याचे अनेक दाखले मिळतात. याबरोबरच त्यांचा नेटका अन् वैभवशाली गृहस्थाश्रम दृष्टीस पडतो. अनेक ठिकाणी प. पू. अप्पांचा एखादा लहान बालकासारखा उत्साह, कवीमनाची रसिकता मंत्रमुग्ध करते, धन्यतेचं गृहस्थ जीवन जगतांना त्यांची वैयक्तिक साधना अतिशय कमी व्यक्त होते. पण श्रीक्षेत्र गंगोत्री येथील साक्षात्काराचा प्रसंग न्याहाळतांना अप्पांच्या श्रीकृष्णकथामृतातील ओळी आठवतात, “सहज खेळकर साधे वर्तन l यातच मोठ्यांचे मोठेपण ll” परमार्थासाठी संसाराचा त्यागच करावा लागतो,  वगैरे ज्या अनेक गैरसमजुती विशेषत: तरुण पिढीच्या मनात असतात, त्या किती निरर्थक आहेत हेच जणू प. पू. अप्पांनी दाखवून दिले. प्रपंच करतानाही परमार्थ कसा साधावा याचा आदर्श म्हणजे प. पू. अप्पांचं जीवन आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'बहुआयामी अप्पांच्या जीवनाचे करारी, कर्तव्यनिष्ठ, भक्त, समर्थ मार्गदर्शक, समन्वयवादी, स्वाभिमानी, साहित्यिक, कवि, रसिक, राष्ट्रप्रेमी असे अनेक पैलू आपल्यासमोर उलगडतात. आयुष्यसुध्दा प्रत्येक क्षणी कसं नियोजनबध्द जगता येतं याचा पाठ मिळतो. कण-कण झिजवून, क्षण-क्षण वेचून किती अफाट कार्य करता येतं, हे पाहिलं की आश्चर्याने थक्क व्हायला होतं. विचार आणि आचारातली ही एकरुपता आपल्याला नवी संजीवनीच जणू देते! धन्य अशा गृहस्थाश्रमानंतर प. पू. अप्पा संन्यासी झाले. प्रत्यक्ष दीक्षाविधीच्या आधी उत्तरकाशी येथे प. पू. अप्पांनी चक्रीभजन केले तेव्हाची छायाचित्रे पाहिली की मन रोमांचित होतं. शुभ्र वेष, पायात चाळ, गळ्यात वीणा, डोईवर केशरी फेटा असा वेष केलेले प. पू. अप्पा पाहतांना असं वाटतं की आपण श्रीतुकोबांच्या कीर्तनात आहोत. देहभान विसरुन, सुरेख पदन्यासातील प. पू. अप्पांच्या विविध मुद्रा पाहतांना त्याची उत्कटता जाणवते.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/kala_keertan_appa.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'नंतर आयुष्यातील शेवटचे काल्याचे कीर्तन करुन मुक्तहस्ताने तापत्रयाचा नाश करणाऱ्या काल्याच्या प्रसादाची उधळण करताना प. पू. अप्पा दिसतात. त्याप्रसंगी प. पू. अप्पा म्हणाले, “मी माझं आयुष्य भगवत्पूजा आणि भगवंताचं हरिकीर्तन यांत जगलो आणि सर्व आयुष्यच उत्सवासारखं पार पडलं. त्याचीच सांगता जणू आज या काल्याच्या कीर्तनाने करीत आहे” आणि खरोखर दुसऱ्या दिवशी श्री. अ. दा. आठवले यांचं श्राध्द स्वत:करुन प. पू. अप्पा, स्वामी वरदानंद भारती झाले.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/kala_distribution.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'संन्यासदीक्षा विधी कोणासही पाहता येत नाही म्हणून दीक्षागुरू महामंडलेश्वर स्वामी विद्यानंदजी गिरी यांच्याकडून दीक्षा घेतानाचे कल्पनाचित्र रेखाटलं आहे. आता अप्पा व्दिजातून त्रिज झाले. भगव्या वस्त्रातील दंडकमंडलू धारण केलेले तेज:पुंज प. पू. अप्पा पाहताना जगदगुरु श्रीशंकराचार्यच अनुभवाला येतात. “येउनी सकल संत जगती l आपुले ठायी अवतरती ll” याचा प्रत्यय या स्मृतीदालनात वेळोवेळी येतो.',
                ),
                WidgetHelper.buildNormalText(
                  'चार वर्ण, चार आश्रम, चार उपासनामार्ग, चार पुरुषार्थ अशा सोळा भक्कम खांबावर हिंदू संस्कृतीचं भव्य मंदिर उभं आहे असं प. पू. अप्पा नेहमी म्हणायचे. तेच सूत्र धरुन केलेली रचना आणि त्या खांबांच्या आधारे ठेवलेली प. पू. स्वामीजींची विपुल ग्रंथसंपदा अतिशय मार्मिक आहे. कारण हे सोळा खांबच प. पू. अप्पांच्या सर्व ग्रंथसंपदेचे आधारस्तंभ आहेत.',
                ),
                WidgetHelper.buildNormalText(
                  'अनुग्रहितांसाठी व अन्य साधकांसाठी प. पू. अप्पांच्या हस्ताक्षरातील आदेश अतिशय आश्वासित व उत्साहित करतो. प. पू. अप्पांनी आम्हा सर्वांसाठी साधना किती सोपी व सुटसुटीत करुन ठेवली आहे, याची जाणीव होते. तसेच हे सर्व प्रत्यक्ष प. पू. अप्पाच सांगत आहेत याची अनुभूती येते.',
                ),
                WidgetHelper.buildNormalText(
                  'प. पू. अप्पांच्या अनेक भावमुद्रा न्याहाळत पुढे सरकताना पाऊले थबकतात ती प. पू. अप्पांच्या संजीवन समाधीच्या प्रसंगापाशी! बाजूलाच प. पू. अप्पांचा संदेश आहे. वरदहस्त उभारुन पालविणाऱ्या नारायणाकडे प. पू. अप्पांनी ओढ घेतली, नारायणाच्या चरणी मस्तक ठेवलं आणि प. पू. अप्पा नारायणस्वरूप झाले. नराचा नारायण झाला. प. पू. अप्पा संदेश देतात, खात्री देतात.',
                ),
                Text(
                  'बोला जय जय नारायण l हरितो तो सारा शीण ll',
                  textAlign: TextAlign.center,
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'श्री ज्ञानदेवांची समाधी प्रत्यक्षात प्रतीत झाली. ही भक्ताची समाधी म्हणावी की योग्याची? या युगातही असं घडू शकतं? काय क्रिया केली असेल? इतकं विलक्षण सामर्थ्य कशाचं असेल? अशा अनेक प्रश्नांचं काहूर मनामध्ये उठतं आणि “आता ना वसन जीर्ण ठेविन हे” या प. पू. अप्पांच्या ओळी आठवतात. मन सैरभैर होतं पण पाऊले जागची हालत नाहीत. सदगुरुंबद्दलचा आदर, प्रेम, अभिमान शतगुणित होतो. अशा सद्गुरुंचं पूजन, सद्गुरुंना अपेक्षित असल्याप्रमाणे, आपल्यालाही घडावं अशी इच्छा प्रकर्षाने होते आणि ही आपली इच्छाही पूर्ण व्हावी म्हणून प. पू. अप्पा सांगतात.',
                ),
                Text(
                  'मी म्हणजे ना शरीर l मी मद्ग्रंथांचा संभार ll \nत्याचे वाचन चिंतन l यथाशक्ती आचरण ll \nहीच गुरुपूजा खरी l नीट धरावे अंतरी ll',
                  textAlign: TextAlign.center,
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'अशी गुरुपूजा प्रत्येकाला घडावी यासाठी प. पू. अप्पांच्या ग्रंथांचं वाचन, चिंतन करण्यासाठी दालनातच सुसज्ज वाचनालयाचीही सोय आहे. या अभ्यासिकेला “वरद चिंतनिका” असे म्हटले आहे. ही चिंतनिका अद्ययावत आसनव्यवस्थेने सुसज्ज आहे. चिंतनिकेत प. पू. श्रीदासगणू महाराज व प. पू. अप्पांच्या ग्रंथसंपदेसोबतच प्राचीन वैदिक वाङ्मयापासून आधुनिक सकल संतसाहित्यापर्यंत अनेक ग्रंथ उपलब्ध करुन देण्याची योजना आहे. जेणेकरुन आपल्या सर्व प्रश्नांची उकल याठिकाणी करुन घेता येईल. या दुर्लभ नरदेहाचं सार्थक करुन घेण्यासाठी सर्व अनुकुल परिस्थिती उपलब्ध आहे. त्याचा जास्तीत जास्त लाभ करुन घ्यावा हीच अपेक्षा.',
                ),
                WidgetHelper.buildNormalText(
                  'चिंतनिकेच्या बाहेरच्या बाजूस गोरठ्याची गुरुपरंपरा दर्शविली आहे. प. पू. अप्पा म्हणत की “श्रीदासगणू महाराजांची वेगळी परंपरा, वेगळा संप्रदाय नाही. व्यास, वाल्मिकींची जी परंपरा, तीच आपली परंपरा!” तिचा क्रमच इथे सांगितला आहे. श्रीव्यास, श्रीशंकराचार्य, श्रीज्ञानेश्वर, श्रीतुकाराम, श्रीरामदास, श्रीसाईबाबा, श्रीवामनशास्त्री, श्रीदासगणू महाराज आणि प. पू. अप्पा, अशी गुरुपरंपरा पहिली की आपण या परंपरेचा अंश असल्याने आनंदाला पारावार राहत नाही. अशा समर्थ परंपरेचा पाईक असल्याने एक वेगळाच आत्मविश्वास मिळतो.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/smriti_dalan.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  '“मी सांगितलेल्या मार्गावर निष्ठेने चालत राहा. तुमचे तुम्ही थक्क व्हाल अशी तुमची भौतिक व पारमार्थिक प्रगती होईल” अशी ग्वाही प. पू. अप्पांनी दिली होती. श्रीकृष्णकथामृतात प. पू. अप्पा म्हणतात, “गुरुवचनावर भाव धरावा l जीवाचा जो अमोल ठेवा ll” त्याप्रमाणे त्यांच्याच मार्गदर्शनाप्रमाणे श्रीदासगणू प्रतिष्ठान, श्रीराधादामोदर प्रतिष्ठान, संतविद्याप्रबोधिनी व संस्कृति विचार सेवक संघ या संस्था अव्याहत प्रामाणिकपणे, निरलसपणे वाटचाल करीत आहेत. त्यांच्या कार्याचं ओझरतं दर्शन आपणाला दालनाच्या शेवटाकडे जातांना होतं. अगदी शेवटी प. पू. अप्पांना केलेली प्रार्थना आहे.',
                ),
                Text(
                  'स्मरणहि तंव संजीवन आम्हा, तंव तेजातिल अंशहि दे l \nकार्य चालवू पुढे निरंतर, सेवेचे वरदानहि दे! \nवरदा हे वरदानहि दे ll',
                  textAlign: TextAlign.center,
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'स्मरणातून मिळणारं हे ‘संजीवन’ या दालनात आम्हा भाविकांना भरभरुन मिळत आहे. प. पू. अप्पांचं जे तेज आम्ही संजीवनमधून अनुभवलं त्यांतील अंशमात्र जरी आम्हाला ग्रहण करता आलं तरी आमचा उध्दार निश्चित आहे.  हे सद्गुरू! आपल्या या कृपेच्या सावलीत आम्हां लेकरांना सदैव स्थान द्या, अशीच प्रार्थना करुन परत एकदा श्रीपांडुरंग, प. पू. श्रीदासगणू महाराज आणि प. पू. अप्पा हे आपले अधिष्ठान डोळ्यात आणि हृदयात साठवत आपण दालनाच्या बाहेर पडतो तेच मुळी “नवसंजीवन” प्राप्त झाल्याच्या आनंदात….!',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/appa_sandesh.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
