import 'package:flutter/material.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class DadaAppaScreen extends StatelessWidget {
  const DadaAppaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'दादा व अप्पा'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  '१९०२ मध्ये नेवासा येथे असताना नटनर्तक श्रीमोहिनीराजाच्या मंदिरात शेवटचा तमाशा सादर करून दासगणूंनी आपल्या शृगांरिक काव्याला स्वतःच्या हाताने ‘आग्नेयस्वाहा:’ केले. पुढे १९०४ मध्ये सद्गुरू श्रीसाईनाथांच्या आदेशानुसार दासगणूंनी पोलिसाच्या नोकरीचे त्यागपत्र दिले व त्यांच्याच आदेशानुसार संतचरित्रे रचण्यास श्रद्धापूर्वक व निष्ठेने प्रारंभ केला. त्या ग्रंथांच्या छपाईच्या कामानिमित्त दादांचा पुण्यातील सदाशिव पेठेत एका स्नेह्यांकडे मुक्काम होता. दुपारी मध्यान्हाच्या वेळी एकदा रस्त्यावर बटू वेशातील एका कुमारवयीन मुलाच्या रडण्याचा आवाज दादांनी ऐकला व त्याबाबत चौकशी केली असता तो मुलगा म्हणाला, “महाराज, मी माधुकरी मागून माझा उदरनिर्वाह करतो. आजची माझी माधुकरी मागून झाली आहे पण आत्ताच एका टांगेवाल्याचा चुकून मला धक्का लागला. त्यामुळे ही माधुकरी आता मी ग्रहण करू शकत नाही. आता मला खायला कोण देणार?”. सुधारणावादी पुणे शहरात आपल्या परंपरागत चालीरीतींवर इतकी गाढ श्रद्धा असणाऱ्या व त्यानुरूप वर्तणूक करणाऱ्या या मुलाचे दादांना मोठे कौतुक वाटले. “बाळ, काळजी करू नकोस, तुझ्या आजच्याच जेवणाची नव्हे तर रोज दुपारच्या जेवणाची व्यवस्था मी करतो हं!” असे वात्सल्यपूर्ण बोलून त्या मुलाला त्यांनी जेवायला दिले. २/३ दिवसातच त्या मुलाचा सात्विक स्वभाव, शुद्ध आचरण, अभ्यासाची आवड, तल्लख बुद्धी, विनयशील वर्तन, सुंदर हस्ताक्षर हे गुण दादांच्या लक्षात आले. त्यांनी त्या मुलाला, माझ्या सोबत कायम राहतोस का? अशी विचारणा केली. दादांचा प्रेमळ स्वभाव व विद्वत्ता पाहून तो मुलगाही दादांकडे आदरपूर्वक आकर्षिला गेला होताच, त्यामुळे त्याने तत्काळ होकार दिला. हा मुलगा म्हणजेच ‘दामोदर वामन आठवले उर्फ दामूअण्णा’!',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदामूअण्णांची ग्रहणशक्ती तीव्र होती व स्मरणशक्ती दांडगी होती. आवाजही उत्तम होता. या गुणांच्या साहाय्याने दामूअण्णांनी दादांची काव्ये मुखोद्गत करून दादांना कीर्तनात उत्तम साथ द्यायला प्रारंभ केला. दादांच्या कीर्तनातील बहुतेक सर्व पदांना चाली स्वतः दामूअण्णांनी दिल्या आहेत. दादांची स्वरचित संतांची कीर्तन आख्याने, त्यांतील भक्तिरसप्रधान काव्ये, त्यांचे समोरच्याच्या हृदयाचा ठाव घेणारे भावपूर्ण विवेचन व त्याला दामूअण्णांची खड्या आवाजतील पदांची साथ, सारे काही अगदी अपूर्व! जणू सोन्याला सुगंध यावा असा तो उत्तम योग जुळून आला होता. श्रीदामूअण्णांची अशी सोबत मिळणे, हा श्रीसाईबाबांच्या कृपाशीर्वादाचाच मूर्त अविष्कार आहे, असेच दादांना वाटत असे. अल्पावधीत या जोडीने आपल्या भक्तिरसपूर्ण भावोत्कट कीर्तनांनी अवघा महाराष्ट्र व्यापून टाकला. त्यांच्या कीर्तनाला अलोट गर्दी होत असे. स्वतः दादा व दामूअण्णा कीर्तन आख्यानात पूर्णपणे रंगून जात व श्रोत्यानांही त्या भक्तिरसात आकंठ भिजवीत असत. वेळेचे भानही राहत नसे. ३/३, ४/४ तास कीर्तनकार व श्रोते कीर्तनाचा सात्विक आनंद भरभरून लूटत असत. एका गावात बालगंधर्वांचे नाटक व दादांची कीर्तने एकत्र नियोजिली गेली. त्यामुळे बालगंधर्वांच्या नाटकांना प्रेक्षकांची अगदी तुरळक उपस्थिती होऊ लागली. स्वतः बालगंधर्व यांनी दादांना त्यांची कीर्तनाची वेळ बदलण्यासाठी विनंती केली, अशी नोंद आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदामूअण्णांची अशी प्रगती पाहून दादा मनोमन समाधानी होते. त्यांनी पुढे इ. स. १९१४ मध्ये श्रीसाईबाबांच्या निर्देशानुसार दामूअण्णांचे लग्न सांगोल्याचे देवी डॉक्टर श्री. श्रीपादराव महाबळ यांची सुकन्या चि. सौ. कां. कमल यांचेशी लावून दिले. सौ. कमल यांचे लग्नानंतर नाव बदलून ‘राधा’ ठेवण्यात आले. शिर्डीत संपन्न झालेल्या या विवाहसोहळ्यास नवदांपत्यास शुभाशीर्वाद देण्यासाठी स्वतः श्रीसाईबाबा उपस्थित होते. याच दांपत्यांच्या पोटी शके १८४२ च्या अनंतचतुर्दशीला (दि.२७/०९/१९२०) एका दिव्य विभूतीचा जन्म झाला. ती विभूती म्हणजेच (पूर्वाश्रमीचे प्राचार्य अनंत दामोदर आठवले उर्फ अप्पा) स्वामी वरदानंद भारती!',
                ),
                WidgetHelper.buildNormalText(
                  'याप्रमाणे कर्तृत्ववान दामूअण्णांचे गृहस्थ जीवन मार्गस्थ झालेले पाहून दादांना अतिशय संतोष वाटत असे. अधूनमधून ते म्हणत असत,”चला, आता मी मोकळा झालो. दामूचे लग्नही झाले. कीर्तनपरंपरा, उत्सव-महोत्सव या साऱ्या गोष्टी आता त्यानेच पहायच्या. संन्यास घेऊन गोदावरीकाठी कुठेतरी निवांत राहावे असे मनात येत”. पण नियतीच्या मनात काही वेगळेच होते. श्रीदामूअण्णांना क्षयाची व्याधी जडली व त्यातच पौष शु. १०, शके १८४२ या दिवशी त्यांचा दुःखद अंत झाला. मानसपुत्र दामूअण्णांच्या अशा अकाली निधनाने दादांवर फार खोल परिणाम झाला. संसारातून निवृत्तीचे विचार मनात घोळत असताना दामूअण्णांच्या अर्धवट संसाराची जबाबदारी त्यांच्या खांद्यावर पडली. तथापि ‘ठेविले अनंते तैसेचि राहावे l चित्ती असू द्यावे समाधान ll’ या संतवचनाशी प्रामाणिक राहत त्यांनी समोर उभ्या ठाकलेल्या कठीण प्रसंगाला धीरोदात्तपणे तोंड दिले. दोन बाळांसह राधामायचा त्यांनी पोटच्या मुलीप्रमाणे सांभाळ केला. राधामाय व दादा, या दोघांच्याही आशेचा अंकुर लहानग्या अनंतासोबत पल्लवित होत होता. आता या दोघांच्याही जीवनाचे ध्येय दामूअण्णांची स्मृती असलेल्या अनंताला वाढविणे, हेच होते.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/dada_appa.png',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'दादांच्या छत्रछायेखाली, वात्सल्यमय निगराणीखाली, भरपूर लाडात अनंताचे बालपण व्यतीत झाले. अनंत जसजसा मोठा होत होता, तसतसा त्याच्यातील सद्गुणांची प्रचिती सर्वांनाच येऊ लागली. जे गुण दामूअण्णांत होते, ते सर्व गुण वाढीव स्वरूपात अनंताच्या ठायी प्रगट झाले होते. त्यामुळे दामूअण्णांच्या वियोगाचे दुःख अनंताच्या उत्तम प्रगतीमुळे काही प्रमाणात उणावत होते. अनंतानेही या दोघांना देता येईल तेवढे आपल्यापरीने संतोष देण्याचे काम आयुष्यभर केले.',
                ),
                WidgetHelper.buildNormalText(
                  'घरात संपूर्ण धार्मिक वातावरण असून देखील कुमार वयात असताना अनंत नास्तिक होता, हे सांगूनही आता पटत नाही. कर्मकांडातून निर्माण झालेल्या अनेक गोष्टी न पटल्यामुळे अनंत दादांसोबत वाद घालीत असे. दादाही न थकता अनंताचे पूर्ण समाधान करण्याचा प्रयत्न करायचे. तथापि त्या वयातही अनंताचे प्रचंड वाचन असल्याने तो बऱ्याच वेळी दादांना भारी पडत असे. तेव्हा एकदा अशा वादविवादाच्या वेळी दादा अनंताला म्हणाले, “गेल्या दहा हजार वर्षांपेक्षाही जास्त काळ आपली हिंदू संस्कृती टिकून आहे. त्यात काही चांगले आहे म्हणूनच ती टिकून आहे ना! तू बुद्धिमान आहेस, तुझे वाचनही खूप आहे. तेव्हा आपल्या संस्कृतीत जे चांगले आहे त्याचा शोध घे ना! आपल्या संस्कृतीचा वकील हो ना!” अन् या एका वाक्याने अनंताच्या विचाराची दिशाच बदलून गेली. नीट पाहू गेल्यास आपल्या संस्कृतीत त्याज्य असे काहीच नाही, असे त्याच्या लक्षात आले. प्रत्येक कर्मामागे काही महत्वाचा विचार असून जनसामान्यांची स्वाभाविक धार्मिक प्रवृत्ती पाहून त्या कर्माला धार्मिकतेची जोड दिली आहे, असे लक्षात आले. तथापि पूर्वग्रहदूषित नजरेने बाधित झालेल्या लोकांनी, ग्राह्य गोष्टी ग्राह्य का आहेत, हे न तपासता दोषारोप केल्याचे लक्षात आले. पुढे आयुष्यभर अशा पाखंड मतांवर अप्पांनी आपल्या ओजस्वी विचारांनी जोरदार प्रहार केले. अशावेळी मग समोर कोण आहे याची भिडभाड न ठेवता, सडेतोड व प्रतिवाद करता येणार नाही अशा शब्दांत अप्पांनी त्यांचा खरपूस समाचार घेतला. पुढे दादांसोबतच्या वादविवादाच्या या प्रसंगाचे जेव्हा-केव्हा अप्पांना स्मरण होत असे, तेव्हा दादांच्या अपार वात्सल्याची आठवण होऊन त्यांचे डोळे भरून येत असत. अप्पा म्हणायचे, “या एका वाक्याने मला लख्ख उजाडले, माझ्या विचाराची व त्यामुळे आयुष्याची दिशाच बदलून गेली.”',
                ),
                WidgetHelper.buildNormalText(
                  'अनंताला नास्तिकतेकडून धार्मिकतेकडे वळविणे असो, राजकारणाकडे जाण्यापासून परावृत्त करणे असो, आयुर्वेदिक शिक्षण घेण्यास प्रवृत्त करणे असो, संतपरंपरा पुढे नेण्यास पाठबळ देणे असो, अप्पांच्या जडणघडणीवर दादांची अमीट छाप आहे. श्रीव्यास, श्रीवाल्मिकी, श्रीशंकराचार्य यांच्या पासून प्रवाहित झालेली शुद्ध भक्तिभावाची, भागवत धर्माची परंपरा, जी पुढे श्रीज्ञानेश्वर, श्रीतुकाराम, श्रीरामदास यांनी वाढविली, तीच परंपरा श्रीदासगणू महाराजांनी पुढे नेली. श्रीअप्पांनीही त्याच परंपरेत भर घालून अधिक वर्धिष्णू केली.',
                ),
                WidgetHelper.buildRichText(
                  'दादांच्या हयातीतच अप्पांनी श्रीदादांच्या चरित्र ग्रंथासह इतर अनेक उत्तमोत्तम ग्रंथांची निर्मिती केली. श्रीतुलसीदासकृत रामचरितमानसच्या चौपाई या काव्य प्रकाराच्या धर्तीवर भगवान श्रीकृष्णाच्या लीलांचे वर्णन करणारे ‘श्रीकृष्णकथामृत’ हे महाकाव्य पाहून तर दादांचा उर आत्यंतिक समाधानाने भरून आला. दादांनी सुरु केलेली संतांच्या उत्सव-महोत्सवाची व कीर्तनाची परंपरा अप्पा समर्थपणे पुढे चालवीत आहेत, हे पाहून दादांच्या समाधानाला पारावार रहात नसे. दादांच्या स्वतःच्या काळापेक्षा संतसंकीर्तन परंपरेला अनंतामुळे आलेली वैभवी अवस्था पाहून दादा अत्यंतिक समाधानाने व कौतुकाने म्हणत,',
                  '“दामूने मला पुढे आणले अन् अनंताने मला मागे सारले”.',
                  TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                  TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
