import 'package:flutter/material.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class GajananMaharajScreen extends StatelessWidget {
  const GajananMaharajScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'श्रीगजाननविजय इतिहास'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  '‘श्रीगजाननविजय’ हा ग्रंथ म्हणजे श्रीदासगणूंनी रचलेल्या संतचरित्रग्रंथमालेचे सहावे पुष्प. शेगाव येथील प्रसिद्ध सत्पुरुष श्रीगजानन महाराज यांचे चरित्र या ग्रंथात वर्णन केले आहे. या ग्रंथाचे २१ अध्याय आहेत आणि प्रत्येक अध्याय श्रीगजानन महाराजांच्या हातून घडलेल्या निरनिराळ्या चमत्कारांचे वर्णन करणारा आहे. या ग्रंथाच्या निर्मितीमागचा इतिहासही फार रोचक आहे.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/gajanan.jpeg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'श्रीगजानन महाराज संस्थान, शेगावचे व्यवस्थापक श्री. रामचंद्र पाटील आणि काही भाविकांनी मिळून श्रीगजानन महाराजांच्या अनेक लीलांची, विशेष घटनांची कागदपत्रे तयार केली आणि संतवाङ्मयाचे गाढे अभ्यासक म्हणून सुपरिचित असलेल्या नाशिकच्या श्री. ल. रा. पांगारकर यांना विनंती केली, ‘महाराज, आपण श्रीगजानन महाराजांचे ओवीबद्ध चरित्र लिहून द्यावे. आमची एवढी विनंती मान्य करावी.’ यावर श्री. पांगारकर म्हणाले, “मी गद्य चरित्र लिहू शकेन. ओवीबद्ध चरित्र लिहिण्याचे सामर्थ्य माझ्यात नाही. याबाबत तुम्ही संतकवी दासगणू महाराजांना विचारा. त्यांच्या अंगी ते सामर्थ्य आहे. आज तरी उभ्या महाराष्ट्रात त्यांच्याइतकी अंतःकरणाची ठाव घेणारी, रसाळ, प्रासादिक, भक्तिरसप्रधान भाषेत आबालवृद्धांना सहज समजेल अशी काव्यरचना करणारी दुसरी व्यक्ती नाही. त्यांना सगळे आधुनिक महिपतीच मानतात. तुम्ही श्रीदासगणू महाराजांनाच विनंती करा”.',
                ),
                WidgetHelper.buildNormalText(
                  'श्री. पाटील आणि सोबतच्या मंडळींचा श्रीदासगणू महाराजांशी परिचय नव्हता. श्री. पांगारकरांच्या म्हणण्यावरून ते पंढरपूरला श्रीदासगणूंकडे आले आणि त्यांनी श्रीगजानन महाराजांचे ओवीबद्ध चरित्र लिहून द्यावे, अशी विनंती केली. श्रीदासगणू महाराजांनी लगेच होकार दिला. श्री. रामचंद्र पाटील यांना अतिशय आनंद झाला. उत्साहाने त्यांनी विचारले, ‘महाराज, आपण लिखाणाचे काय मानधन घ्याल?’ श्रीदासगणू महाराज हसले व म्हणाले, ‘पाटील! मी लिहून देत नाही.’ पाटील चपापले व म्हणाले, ‘महाराज, असे का म्हणता?’ यावर महाराज म्हणाले, “लिहून देणारा मी कोण? मला प्रेरणा देणारा माझा पांडुरंग विटेवर उभा आहे. त्याच्याच कृपेने सर्व लिहिले जाते. माझी यत्किंचितही ताकद नाही. मग मानधन कशाचे?” अगदी सहजपणे श्रीदासगणू महाराजांनी असे म्हटले, पण ते ऐकून श्री. पाटील व सोबतची मंडळी थक्क झाली.',
                ),
                WidgetHelper.buildNormalText(
                  'त्यांनी पहिल्यांदाच श्रीदासगणू महाराजांना पाहिले होते. अत्यंत साध्या वेषात असूनही श्रीदासगणू महाराजांची तेजस्विता स्वाभाविकपणे प्रगट होत होती. मुद्रेवर तेज होते पण ते डोळे दीपविणारे नव्हते. डोळ्यांमध्ये त्यांच्या बुद्धीची, ज्ञानाची चमक होती आणि त्याच वेळी वत्सल, आश्वासक भावही होते. दृष्टी स्थिर होती, बोलण्यात आत्मविश्वास होता पण अहंकाराचा लवलेश नव्हता. उलट कर्ता–करविता पांडुरंग अशीच भावना होती. मी करतो आहे अशी धारणा मुळीच नव्हती. श्री रामचंद्र पाटीलांनी महाराजांच्या पायावर डोके ठेवले. संत श्रीगजानन महाराजांचे चरित्र लिखाणासाठी अगदी सुयोग्य सत्पुरुष लाभला आहे, या विचाराने त्यांच्या डोळ्यात आनंदाश्रू आले.',
                ),
                WidgetHelper.buildNormalText(
                  'दरम्यान श्रीदासगणू महाराजांची डोळ्याची शस्त्रक्रिया झाली. त्यानंतर तीन आठवडे विश्रांती घेऊन ते शेगावला आले. शेगाव स्थानकावर श्रीदासगणू महाराजांचे मोठे स्वागत करण्यात आले. श्री.रामचंद्र पाटील व मंडळींनी एक रथ सजवून आणला होता. श्रीदासगणू महाराजांना रथात बसवून वाजत गाजत मंदिरापर्यंत न्यावे ही त्यांची इच्छा होती. पण श्रीदासगणूंनी ते मान्य केले नाही. ते म्हणाले, “पाटील, थोर सत्पुरुषांच्या भेटीला या रथात बसून मी येणार नाही. तो माझा अधिकार नाही. मी सकलसंतांचा चरणरज आहे. कृपा करून मला रथात बसण्याचा आग्रह करू नका. या रथात श्रीगजानन महाराजांचे छायाचित्र ठेवा. मी रथाच्या मागून पायी चालत येतो” आणि ते पायी चालतच मंदिरापर्यंत आले. श्रीदासगणू महाराज स्वतःला नुसते संतचरणरज म्हणत नसत तर मी म्हणजे या संतांच्या पायाची धूळ आहे अशी त्यांची प्रामाणिक भावना होती, ‘अमानित्वम्, अदंभित्वम्…’ ही लक्षणे त्यांना पूर्णपणे लागू होती. मंदिरात आल्यानंतर शुचिर्भूत होऊन श्रीदासगणू महाराजांनी श्रीरामचंद्राचे दर्शन घेतले, श्रीगजानन महाराजांचे दर्शन घेतले. श्रीविष्णुसहस्रनामाचा पाठ केला. सद्गुरू ज्ञानेश्वर तुकाराम महाराज की जय! जयजय रघुवीर समर्थ!! असा जयघोष केला आणि त्यांच्या तोंडून शब्द बाहेर पडले -',
                ),
                Text(
                  'सतेज दुसरा रवि हरिसमान ज्याचे बल l \nवसिष्ठासम सर्वदा तदीय चित्त ते निर्मल ll \nअसे असुनिया खरे वरिवरि पिसा भासतो l \nतया गुरु गजाननाप्रति सदा गणू वंदितो ll',
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराज शीघ्रकवि होते. त्यांनी लगेच चरित्रलेखनास आरंभ केला. शेगाव संस्थानच्या विश्वस्तांनी उपलब्ध केलेल्या कागदपत्रांच्या आधारे त्यांचा रोज एक अध्याय लिहून तयार होत असे. श्रीगजानन महाराजांना प्रत्यक्ष बघितलेली, त्यांच्या दिव्य लीलांचा अनुभव घेतलेली काही मंडळी त्यावेळी उपलब्ध होती. त्यांच्याशी चर्चा करून त्या त्या प्रसंगांची श्रीदासगणू महाराज अध्याय लिहिण्यापूर्वी खातरजमा करून मगच अध्याय रचित असत. अशाप्रकारे २१ दिवसात २१ अध्यायांचे रसाळ, प्रासादिक चरित्र लिहून पूर्ण झाले.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/vijay.jpeg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'संतकवी श्रीदासगणू महाराजांची अलौकिक प्रतिभा आणि स्वतःला संतचरणरज म्हणविणाऱ्या श्रीदासगणू महाराजांची नम्रता पाहून शेगाव संस्थानचे विश्वस्त मंडळ फार प्रभावित झाले. त्यांनी श्रीदासगणू महाराजांचा सत्कार करायचे ठरविले आणि त्याची पूर्ण तयारी केली. धोतरजोडी, उपरणे, शाल, रेशमी रुमाल, श्रीफळ आणि मोठी रक्कम असलेले पाकीट असे साहित्य तयार ठेवले. श्रीदासगणूंनी लिखाणाचे मानधन नाकारले होते तेव्हा सत्काराच्या निमित्ताने काही द्यावे असा विश्वस्तांचा हेतू होता. श्री. पाटील म्हणाले, “महाराज! आम्ही आपणास काय देणार? हा श्रीगजानन महाराजांचा प्रसाद असे समजून त्याचा स्वीकार करावा”.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराज म्हणाले, “मी संतांच्या दरबारात आलोच आहे तर त्यांचा प्रसाद घेतल्याशिवाय कसा जाईन? पण तो प्रसाद मी तुमच्या इच्छेने घेणार नाही, माझ्या इच्छेने घेईन. तुम्ही विश्वस्त मंडळींनी आपसात निधी गोळा करून ही तयारी केलीत ना! आपल्या संस्थानची परिस्थिती साधारणच आहे याची मला कल्पना आहे. तेव्हा हे पाकीट आपल्या संस्थेत जमा करा. रुमाल आणि श्रीफळ एवढाच प्रसाद राखून बाकी सर्व वस्तू ज्यांना खरंच गरज असेल अशांना आनंदाने देऊन टाका”. महाराज पुढे म्हणाले, “आणि पाटील साहेब! या ‘श्रीगजाननविजय‘ ग्रंथाचे सर्व हक्क मी तुमच्या संस्थानला सुपूर्द करतो. श्रीगजानन महाराजांच्याच कृपेने हा ग्रंथ लिहिला गेला आहे तो त्यांचेच चरणी समर्पित करतो”. हे ऐकून श्री. रामचंद्र पाटील यांचे नयन अश्रूंनी डबडबले व त्यांनी कृतज्ञतापूर्ण भावाने हात जोडले; त्यांचे ते हात कितीतरी वेळ जोडलेलेच राहिले.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीगजानन महाराज संस्थान, शेगाव, तर्फे आजतागायत या ‘श्रीगजाननविजय’ ग्रंथाच्या मराठीत ५१ आवृत्त्या प्रकाशित झाल्या असून या आवृतीपर्यंत एकूण प्रती संख्या २६,५९,६०० झालेली आहे. हिंदी, इंग्रजी, गुजराती, कन्नड व तेलुगु या भाषांमध्येही या ग्रंथाचा अनुवाद करण्यात आलेला आहे. भावभक्तीने या ग्रंथाचे पारायण केले असता अनुभूतीची प्रचिती आल्याचा असंख्य भक्तांचा अनुभव आहे. या ‘श्रीगजाननविजय’ ग्रंथाच्या नित्य पठण, पारायणाने लक्षावधी भाविक सन्मार्गरत होऊन शेगाव संस्थानशी जोडले गेले. ‘संतकुळीचा भाट’ असणाऱ्या श्रीदासगणू महाराजांच्या संतचरित्रे आणि संतविचार यांच्या प्रचार-प्रसाराच्या कार्याचे, आजचे हे दृष्य फलितच आहे!',
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
