import 'package:flutter/material.dart';
import 'package:flutter_svg/svg.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/routes/app_routes.dart';
import 'package:varadvani/theme/color_code.dart';

class GuruShishyaScreen extends StatelessWidget {
  const GuruShishyaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'गुरु–शिष्य'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  'पूर्वार्धात शेवटी नमूद केल्याप्रमाणे श्रीसाईबाबा दासगणूंना गुरुस्थानी वंदनीय असले तरी ते त्यांचे उपदेशगुरु नव्हते. त्यांना मंत्रदीक्षा देणारे सद्गुरू होते श्रीवामनशास्त्री इस्लामपूरकर! आणि श्रीवामनशास्त्रींच्या सांगण्यानुसारच दासगणूंची श्रीसाईबाबांवर दृढ श्रद्धा जडली होती. बरीच वळणे असलेले हे सर्व प्रकरण मुळापासून पाहणे मोठे रंजक आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'त्याचे झाले असे की, दासगणू पोलिसात असताना एक अतिवरिष्ठ सरकारी अधिकारी प्राच्यविद्या संशोधनांतर्गत काही ऐतिहासिक ग्रंथांच्या संशोधनासाठी श्रीगोंद्याला येणार होते. त्यांची सुरक्षा व वैयक्तिक मदतीसाठी दासगणूंची नियुक्ती झाली होती. त्यांच्या स्वागतासाठी दासगणू रोज रेल्वेस्थानकावर जात होते पण त्या अधिकाऱ्यास यायला विलंब होत होता. त्याकाळी आजच्यासारखा संपर्काच्या सुविधांचा सुकाळ नव्हता. त्यामुळे त्यांच्या येण्याबाबत निश्चित माहिती मिळत नव्हती. २-३ दिवस होवूनही अधिकारी न आल्याने दासगणू वैतागून गेले होते. सायंकाळी खानावळीत मित्रांसोबत जेवण घेत असताना याविषयी त्यांची टवाळी चालू होती. “काय तर म्हणे वरिष्ठ अधिकारी अन् वेळेवर यायचा पत्ता नाही. अजून किती हेलपाटे मारायचे काय माहिती? आम्हाला आमची काही कामे आहेत का नाही?”- इति दासगणू. ते वरिष्ठ अधिकारी आलेले त्यांच्या लक्षात आले नाही आणि ते त्यांच्या समोरच जेवण घेत आहेत, हे तर दासगणूंच्या मनीही नव्हते. दुसरे दिवशी विश्रामगृहात चौकशी केली असता ते वरिष्ठ अधिकारी आल्याचे समजले. त्यांची ओळख करून घेण्यासाठी दासगणू गेले असता काल ज्यांची टिंगल आपण करीत होतो तेच अधिकारी समोर पाहून दासगणू चपापलेच. त्यांनी मोठ्या विनयशीलतेने त्यांची माफी मागितली. आपण एकमेकांना पाहिले नसल्याने हा गोंधळ झाला आहे, तेव्हा माफी मागण्याचे कारण नाही, असे तो अधिकारी म्हणल्याने दासगणूंना त्यांच्या सात्विक स्वभावाची जाणीव झाली. हे वरिष्ठ अधिकारी म्हणजेच पंडित वामनशास्त्री इस्लामपूरकर!',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीइस्लामपूरकर त्यांच्या संशोधनाच्या कामात व्यग्र असताना दासगणू सरकारी कर्तव्य व शिष्टाचारानुसार पूर्णवेळ त्यांच्या सोबत असायचे. अत्यंत निरलसपणे व निष्ठापूर्वक काम करण्याची त्यांची शैली पाहून दासगणू अत्यंत प्रभावित झाले होते. त्यातच पहाटे चार-साडेचार वाजता त्यांच्या खोलीत दिवा लागलेला दिसायचा व काहीतरी वाचन चालू असल्याचा आवाज यायचा. इतक्या सकाळी हे काय करीत असावेत? याची दासगणूंना मोठी उत्सुकता लागली होती. त्यांनी याचा कानोसा घ्यायचा निश्चय केला. एके दिवशी अगदी पहाटे दरवाजाच्या फटीतून त्यांनी पहिले की, शास्त्रीजी शुचिर्भूत होऊन श्रीभागवताचे वाचन करीत असून भगवंताच्या लीलांचे वर्णन वाचताना भक्ति-प्रेमरसाचा आवेग त्यांना अनावर होतो आहे व तो प्रेमरस त्यांच्या डोळ्यातून अखंडपणे स्रवत आहे. त्यांची छाती अश्रूंच्या धारांमुळे ओलीचिंब झाली होती. हे दृश्य पहिले अन् दासगणूंनी मनोमन त्यांना प्रणिपात केला. आता यानंतर त्यांच्या कर्तव्याला विनम्रतेची झालर आली व अधिक प्रेमादाराने शास्त्रीजींची सेवा ते करू लागले. शास्त्रीजीही त्यांचा सेवाभाव पाहून आनंदित झाले. त्यांचे कामकाज आटोपल्यानंतर निरोप घ्यायची वेळ आली असता दासगणूंच्या सेवाभावावर खुश होवून प्रसन्नतेने स्वतःची अंगठी त्यांना बक्षीस म्हणून देवू केली. तेव्हा दासगणूंनी त्यांच्या पायावर लोळण घेतली व तुमचा सद्गुरू या रूपात मी मनोमन स्वीकार केला आहे, तेव्हा तुम्हाला मला बक्षीस द्यायचेच असेल तर तुमचा अनुग्रह हेच मला बक्षीस द्या, असा आग्रह धरला. मला हे अनुग्रह देणे वैगरे काही माहित नाही, असे सांगून प्रथमतः शास्त्रीजींनी ही मागणी धुडकावून लावली. गुरुमंत्र घेतल्याशिवाय हे चरण मी सोडणारच नाही, असा दासगणूंचा ठाम निश्चय पाहून त्यांनी शेवटी होकार दिला व विधिवत गुरुमंत्र देवून पंढरीच्या वारीचा नेम सांगितला.',
                ),
                WidgetHelper.buildNormalText(
                  'पुढे शास्त्रीजींनी काशीला देहत्यागाचा आपला निर्णय पक्का केला असता काशीला जातेवेळी दासगणूंना दौंड स्टेशनवर बोलावून घेतले व दौंड ते भुसावळ या दरम्यानच्या प्रवासात आपल्या सोबत घेऊन आपली सर्व ऐहिक व पारमार्थिक संपत्ती दासगणूंच्या हवाली केली व आपला निर्णय त्यांना सांगितला. ते ऐकून “सद्गुरुनाथा, तुम्ही मला असे सोडून गेल्यावर माझी गती काय?” असे म्हणत दासगणू ओक्साबोक्षी रडू लागले. तेव्हा त्यांचे सांत्वन करून शास्त्रीजी म्हणाले की “येथून पुढे तू मला शिर्डीच्या साईबाबांमध्ये पहा, तेच तुला योग्य मार्गदर्शन करतील”. पुढे श्रीवामनशास्त्री यांनी काशी येथे ज्येष्ठ वद्य एकादशीला (इ. स. १८९७) आपला देह श्रीविश्वेश्वराच्या चरणी अर्पण केला. श्रीदासगणू महाराज यांच्या व्यतिरिक्त श्रीवामनशास्त्री महाराजांचा दुसरा कोणीही शिष्य नव्हता. श्रीवामनशास्त्री महाराजांचे अनेक अंगांनी श्रीदासगणू महाराज हे “एकमेवाव्दितीय” शिष्य होते.',
                ),
                WidgetHelper.buildNormalText(
                  'शास्त्रीजींनी दिलेली लौकिक संपत्तीची कागदपत्रे घेवून दासगणू गुरुमाईंना भेटायला गेले असता, आपल्या हक्काच्या संपत्तीवर हा कोण अधिकार दाखवीत आहे? या विचाराने त्यांनी दासगणूंचा दुःस्वास केला. तथापि निःस्पृह असलेल्या दासगणूंनी आपल्या नावाची असलेली सर्व कागदपत्रे गुरुमाईंना सुपूर्द केली व त्याबदल्यात शास्त्रीजींच्या नित्य पूजेतील श्रीपांडुरंगाची मूर्ती मागून घेतली. दासगणू महाराजांच्या दृष्टीने अलौकिक असलेला हा सौदा, लौकिकाला महत्व देणाऱ्या त्या माउलीने अत्यंत तातडीने अंमलात आणला. श्रीविठ्ठलाची ही प्रासादिक मूर्ती आजही पंढरपूरच्या दासगणूंच्या देवघरात प्रसन्नतेने विराजमान आहे.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/saibaba.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'तद्पूर्वी दासगणूंना श्रीसाईबाबांचे प्रथम दर्शन इ. स. १८९४ मध्ये झालेच होते. सद्गुरु श्रीवामनशास्त्रीजींच्या निर्देशामुळे त्यांची श्रीसाईबाबांवरची श्रद्धा बळावत गेली. पुढे नोकरीत असताना त्यांचा स्वतःचा काही दोष नसताना आलेल्या बालंटांमुळे व विशेषतः दरोडेखोर कान्ह्या भिल्लाच्या कठीण प्रसंगांमुळे ती दृढ झाली. श्रीसाईबाबांच्या आदेशानुसारच दासगणू नांदेडला आले, नोकरीचा त्याग केला व त्यांच्याच आदेशरूपी आशीर्वादाने अनेक संतांची ओवीबद्ध चरित्रे आणि ८५ च्या जवळपास कीर्तनोपयोगी आख्याने रचली. श्रीभक्तिसारामृत, श्रीसंतकथामृत व श्रीभक्तिलीलामृत ही संतांची ओवीबद्ध चरित्रे असणारे त्यांचे ग्रंथ प्रसिद्ध आहेत. १९१८ मध्ये श्रीसाईबाबांनी देहत्याग केला. तोपर्यंत म्हणजे २४ वर्षे दासगणू साईबाबांच्या सान्निध्यात होते; ते बाबांचे अंतरंग शिष्य होते. श्रीसाईबाबांच्या जीवनातील अनेक नाट्यमय प्रसंगांचे स्वतः दासगणू प्रत्यक्ष साक्षीदार होते. अशा अनेक घटनांचा उल्लेख “श्रीसाईचरित्र” या ग्रंथात आढळतो. श्रीसाई संस्थानचे श्रीदासगणू महाराज संस्थापक अध्यक्ष होते व हे दायित्व त्यांनी ३९ वर्षे सांभाळले होते.',
                ),
                WidgetHelper.buildNormalText(
                  'शिर्डीत असताना श्रीरामनवमीच्या उत्सवात नेहमीच्या पद्धतीप्रमाणे पगडी, करवतकाठी उपरणे आणि डेरेदार पांढरा शुभ्र अंगरखा असा पोशाख करून श्री दासगणू कीर्तनास निघाले. जाताना नमस्कार करण्यासाठी श्रीसाईबाबांकडे गेले असताना बाबांनी विचारले, “कुठे निघालास गणू?”, “कीर्तनास जातो बाबा”, “असा नवऱ्यामुलासारखा नटून? अरे परमार्थाकरिता कीर्तन ना? संसारात अलिप्त रहावे, हे सांगणार ना तुम्ही? मग हा थाटमाट आणि नखरा कशासाठी? काढ काढ ते सगळे”.',
                ),
                WidgetHelper.buildNormalText(
                  'बाबांनी दासगणूंच्या अंगावरील अंगरखा, पगडी काढून उपरणे तेवढे अंगावर घ्यावयास दिले आणि म्हणाले, “जा, असेच करीत जा कीर्तन”. तेव्हापासून दासगणू उघड्या अंगावर एक उपरणे तेवढे घेऊन कीर्तन करू लागले. श्रीदासगणू परिवारातील कीर्तने सादर करणारा कीर्तनकार आजही याच पद्धतीने कीर्तने करीत असतो.',
                ),
                InkWell(
                  onTap: () => Navigator.pushNamed(
                    context,
                    AppRoutes.kanhyaBhillaScreen,
                  ),
                  child: Container(
                    width: double.infinity,
                    decoration: BoxDecoration(
                      color: Color(ColorCode.white),
                      boxShadow: [
                        BoxShadow(
                          color: Color(ColorCode.black).withValues(alpha: 0.04),
                          blurRadius: 5,
                          spreadRadius: 1,
                          offset: Offset(0, 1),
                        ),
                      ],
                      borderRadius: BorderRadius.all(Radius.circular(12)),
                    ),
                    child: Padding(
                      padding: const EdgeInsets.symmetric(
                        horizontal: 20,
                        vertical: 15,
                      ),
                      child: Row(
                        mainAxisAlignment: MainAxisAlignment.spaceBetween,
                        crossAxisAlignment: CrossAxisAlignment.center,
                        children: [
                          Flexible(
                            flex: 8,
                            child: Text(
                              'श्रीमहाराजांच्या जीवनाला कलाटणी देणारे दरोडेखोर कान्ह्या भिल्लाचे प्रकरण',
                              style: TextStyle(
                                fontSize: 18,
                                fontFamily: 'Mukta',
                                color: Color(ColorCode.orange),
                                letterSpacing: 0,
                                height: 1.5,
                              ),
                            ),
                          ),
                          Flexible(
                            flex: 2,
                            child: SvgPicture.asset(
                              'assets/svg/arrow.svg',
                              colorFilter: ColorFilter.mode(
                                Color(ColorCode.black),
                                BlendMode.srcIn,
                              ),
                            ),
                          ),
                        ],
                      ),
                    ),
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
