import 'package:flutter/material.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class KanhyaBhillaScreen extends StatelessWidget {
  const KanhyaBhillaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'कान्ह्या भिल्लाचे प्रकरण'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  'इ. स. १८९३ मध्ये श्रीदासगणू महाराज पोलीस खात्यात रुजू झाले होते. महसूल खात्यातील वरिष्ठ अधिकारी श्री. नानासाहेब चांदोरकर यांचेशी त्यांचे उत्तम संबंध प्रस्थापित झाले होते. श्री. चांदोरकर हे श्रीसाईबाबांचे शिष्य होते. त्यांच्या समागमे जाऊन श्रीदासगणू महाराजांनाही प्रथम इ. स. १८९४ मध्ये श्रीसाईबाबांच्या दर्शनाचा लाभ झाला होता. तद्नंतरही बऱ्याच वेळा श्री. दासगणूंना बाबांच्या दर्शनाचा लाभ झाला होता (पुढे हे गुरुशिष्य संबंध इतके दृढ झाले की श्रीदासगणू बाबांच्या अंतरंग शिष्यांपैकी एक शिष्य बनले). त्रिकालदर्शी साईबाबा दासगणूंना “गणू, अरे तुझा जन्म बुटं पुसण्यासाठी नाही रे!” असे म्हणत नोकरी सोडण्यासाठी मागे लागले होते. नोकरी सोडणे राहिले दूर, दासगणूंना स्वतःच्या कर्तबगारीच्या जोरावर वरिष्ठ पदाच्या पदोन्नतीचे वेध लागले होते. त्यामुळे दासगणू शिर्डीला जाणे टाळू लागले. सेवेत असताना काही दोष नसताना त्यांच्यावर २/३ वेळा बालंट आले होते. त्या प्रत्येक वेळी त्यांना बाबांच्या वचनाचे स्मरण होऊन त्यांनी नोकरी सोडण्याची प्रतिज्ञा केली होती. पण नोकरीचा मोह काही सुटत नव्हता. पण इ. स. १८९८ साली घडलेल्या भयंकर दरोडेखोर कान्ह्या भिल्लाच्या कठीण प्रसंगामुळे दासगणूंच्या जीवनाला मोठी कलाटणी मिळाली.',
                ),
                WidgetHelper.buildNormalText(
                  'इ. स. १८९८ च्या सुमारास कान्ह्या भिल्ल नावाच्या एका दरोडेखोराची फार दहशत होती. त्याला पकडण्यासाठी मोगलाईतील व इंग्रजांच्या पोलिसांनी प्रयत्नांची पराकाष्ठा केली पण त्यांना यश येत नव्हते. कान्ह्या भिल्ल काही हाती लागत नव्हता. त्याने कित्येक गावे लुटली, शेठसावकारांचे बळी घेतले. पोलिसांवरही हल्ले केले. हेही कमी म्हणून की काय, पूर्वसूचना देऊन दिवसाढवळ्या दरोडे घातले. लोकांच्या जीवाचा, संपत्तीचा भरवसा उरला नाही. सरकारने त्याला पकडण्यासाठी, त्याची बित्तंबातमी मिळविण्यासाठी गुप्तहेर नेमण्याचे ठरविले. त्यासाठी हुशार शिपायांची यादी करण्यात आली. एका वरिष्ठ अधिकाऱ्याचे आणि श्रीदासगणूंचे वितुष्ट होते. त्याने या धोक्याच्या कामी नेमणूक व्हावी म्हणून मुद्दाम दासगणूंचे नाव वर कळविले. “गणेश दत्तात्रेय सहस्रबुद्धे हा चाणाक्ष शिपाई असून गुन्ह्याचा तपास फार चांगला करतो” असे प्रशस्तिपत्रही जोडले. झाले, श्रीदासगणूंना या धोक्याच्या कामी पाठविण्यात आले.',
                ),
                WidgetHelper.buildNormalText(
                  'लोणीच्या गंगाराम पाटलाशी कान्ह्या भिल्लाचा संबंध आहे, अशी कुणकुण असल्याने या भागात शोध करण्याची जबाबदारी श्रीदासगणूंवर सोपविण्यात आली. ते लोणी गावी आले ते रामदासी वेषात. कुबडी, रामनामी, चिपळ्या, दासबोध, ज्ञानेश्वरी, पांढऱ्या घोंगड्या अशा सर्व साहित्यासह श्रीदासगणू खरेच रामदासी दिसत होते. सद्गुरूपदेशामुळे मी रामदासी झालोच आहे, तेव्हा सोंगच घ्यायचे ते त्यातल्या त्यात बरे असावे या विचाराने रामदासी वेष दासगणूंनी पत्करला. (इ. स. १८९६ मध्ये सद्गुरु श्रीवामनशास्त्रींची भेट झाली व उपदेश घेतला होता)',
                ),
                WidgetHelper.buildNormalText(
                  'लोणी गावातल्या राममंदिरात रामदासी वेषातील श्रीदासगणू उतरले. मंदिर जुने होते. कित्येक दिवसांत त्याकडे कोणी लक्ष दिलेले नव्हते. सर्वत्र केर-पाचोळा-जळमटे होती. देवाची पूजाही कित्येक दिवसात झाली नव्हती. हिंदू मंदिराची ही दशा काही नवीन नव्हती. मान खाली घालायला लावणारी ही लाजिरवाणी परिस्थिती पाहून श्री दासगणूंच्या मानत विचारांचे काहूर माजले. मंदिराची अशी दैना व श्रीरामाच्या मूर्तीची अनास्था पाहून श्रीदासगणूंना फार वाईट वाटले. त्यांचे डोळे भरून आले. श्रीरामाच्या पायावर डोके ठेवून ते म्हणाले, “रामराया, आपल्यामागे सदा वनवासच का हो?” त्यांना पुढे बोलवेना. नुसती तक्रार करणारे, दुःख करणारे श्रीदासगणू नव्हते. स्वतः पाच-सहा तास खपून त्यांनी मंदिर स्वच्छ केले. पाकोळ्यांची घरटी, घाण, जळमटे काढली. केरकचरा झाडून काढला. शेण आणून सारवूनही टाकले. ऊद आणून जाळला. दासगणूंच्या अथक परिश्रमांनी त्या स्थानाला आता थोडे प्रसन्न मंदिराचे स्वरूप आले. तल्लीन होऊन भक्त भगवंताची सेवा करीत होता.',
                ),
                WidgetHelper.buildNormalText(
                  'प्रभू श्रीरामचंद्रांची पूजा श्री दासगणू अत्यंत आनंदाने, आवडीने करीत. ते गुप्तवेषातील हेर होते पण या कामी कृत्रिमतेचा लवलेशही नव्हता. ते पवमान, रुद्राची आवर्तने म्हणत, अभिषेक करीत, स्वयंपाक करून नैवेद्य दाखवित, दुपारी विष्णुसहस्रनामाचे १२ पाठ म्हणत व संध्याकाळी दासबोध, ज्ञानेश्वरी यांचे वाचन करीत. रात्री भजन करून निद्रा घेत. कोणाशी विशेष बोलत नसत.',
                ),
                WidgetHelper.buildNormalText(
                  'हळूहळू देवळात दर्शनाकरिता बरीच मंडळी येऊ लागली. श्रीरामापुढे काही धान्य, खारका, शेंगा, गूळ, क्वचित पैसे येऊ लागले. रामदासीबुवा त्यातील काही धान्य, खारका, शेंगा, गूळ ठेवून घेत आणि धान्य व पैसे देवळाचे पुजारी श्री. बाळंभट यांना देऊन टाकीत. अर्थातच रामदासीबुवांबद्दल गावकऱ्यांत कुतूहल निर्माण झाले. तर्कवितर्क होऊ लागले. श्रीदासगणूंनी ओळखले, आता सावध राहणे आवश्यक आहे. संध्याकाळी गुराखी मुले देवळात जमत. श्रीदासगणू ठेवून घेतलेल्या खारका, शेंगा, गूळ या मुलांना वाटीत. प्रौढांशी फारसे न बोलणारे रामदासी वेषातील दासगणू या मुलांशी मात्र मोकळेपणाने बोलत. यातूनच त्यांना हवी ती माहिती मिळत होती. “कान्ह्या भिल्ल गंगाराम पाटलाकडे येतो. त्याला धरण्यास शिपाई येतात”, अशा बातम्या ती मुले देत.',
                ),
                WidgetHelper.buildNormalText(
                  'एके दिवशी गंगाराम पाटील मंदिरात आले. ‘माझा हात बघा की जरा’ अशी विनंती त्यांनी रामदासीबुवांना केली. बुवांनी दुसरे दिवशी येण्यास सांगितले. बुवांच्या बोलण्याचालण्यातील गंभीरपणाचा पाटलाच्या मनावर चांगलाच परिणाम झाला. दुसरे दिवशी सकाळीच ते आले. बुवांनी बराचवेळ हात निरखला, रेषांचे जाळे तपासले आणि म्हणाले,”पाटील, तुम्हाला संतती, संपत्ती चांगली आहे. पण तुम्हाला होणारा द्रव्यलाभ चोरापासून होईल वा झाला असेल. चांगल्या मार्गाने नाही.” ऐकीव माहितीच्या आधारेच श्रीदासगणू पाटलाशी बोलले होते. पण पाटलांना द्रव्यलाभाची रामदासीबुवांनी सांगितलेली खूण पटली. त्यांची दृढ श्रद्धा रामदासीबुवांवर बसली. गावात बुवांचा मानसन्मानही वाढला.',
                ),
                WidgetHelper.buildNormalText(
                  'लोकांची स्वतःविषयीची ती पूज्यबुध्दी पाहून श्रीदासगणू व्याकुळ होत. श्रीरामचंद्राच्या मूर्तीपुढे बसून ते क्षमायाचना करीत. “रामा, या भाबड्या लोकांची मी वंचना करीत आहे. लोक मला साधू समजतात. पण माझ्यामुळे यातल्या कितीतरी जणांवर संकट येणार आहे. देवा, माझ्या या कृतघ्नपणाला तू कोणती शिक्षा देणार आहेस?”',
                ),
                Text(
                  'नोकरीच्या कामाकरिता हा रामदासी वेष धारण केला होता, पण वेषाकरिता म्हणून कराव्या लागणाऱ्या पूजापाठात श्रीदासगणूंना विलक्षण गोडी वाटू लागली. धर्माचरणात किती उदात्त सुख व शांती साठविली आहे याचा अनुभव येऊ लागला. ‘लोक मला खरेच साधू समजतात, माझ्या भजनी लागले आहेत. थोड्याशा चांगल्या वर्तनाला जर एवढे फळ मिळते, तर ज्याचे आचरण अंतर्बाह्य शुद्ध व सात्विक झाले आहे, तो केवढ्या योग्यतेस चढेल!’ असे विचार श्री दासगणूंच्या मनास उजळून टाकू लागले. त्या प्रकाशाची, तेजाची ओढ आता त्यांच्या मनास लागली.',
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'एकीकडे कान्ह्याने त्याच्या मागावर असणाऱ्यांची हत्या किती निर्घृणपणे केली त्या भयंकर वार्ता कानी येत. श्री दासगणूंसोबतच गुप्तहेर म्हणून नेमलेल्या दोघांस कान्ह्याने ठार मारले होते. त्यातील एकास तर कुऱ्हाडीने सरपणासारखा तोडला होता. मृत्यूची ही धाड केव्हा कोसळेल याचा नेम नव्हता. एकीकडे लोकांची फसवणूक करावी लागत आहे आणि दुसरीकडे मरणाची तलवार सदैव डोक्यावर टांगलेली आहे, अशा कोंडीत श्रीदासगणू सापडले होते. पोलिसाच्या नोकरीमुळे हे होत आहे, असे वाटून त्यांनी श्रीरामरायाची प्रार्थना केली...',
                ),
                Text(
                  'नको नोकरी ही मला पोलिसाची l \nबहु भ्रष्टवी कष्टवी चित्त साची l \nमला त्यातुनी सत्वरी सोडवावे l \nरमानायका, चित्ती माझ्या वसावे ll',
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'एक दिवस कान्ह्या भिल्ल गंगाराम पाटलाकडे रात्रीचा आला आणि त्याने पाटलास विचारले - “तो रामदासी कोण आहे पाटील?” “तो चांगला साधू आहे. नाईक, त्याला त्रास देऊ नका” - पाटील उत्तरले. “साफ खोटे. तो पोलीस आहे. मी माहिती काढली आहे. चला आत्ताच त्याच्याकडे जाऊ”. दोघे राममंदिरात आले. कान्ह्याच्या हातात बंदूक होती. पाटलांनी बुवांना जागे केले. बुवांनी डोळे उघडले तो समोर दिसले पाटील आणि कान्ह्या. हातात बंदूक घेतलेली कान्ह्याची ती काळी कुळकुळीत, ठेंगणी,  उग्र मुद्रा असलेली आकृती पहिली अन् बुवांचा थरकाप झाला. कान्ह्याने दरडावून विचारले, “कोण आहेस तू? तुझं नाव गणेश दत्तात्रय सहस्रबुद्धे. तुझा बक्कल नंबर ७२७. खरं आहे की नाही बोल!” बुवा आश्चर्याने थक्क झाले. आपल्या जोडीदाराची याच कान्ह्याने नुकतीच काय दशा केली तेही आठवले. जीविताची उरली सुरली आशाही नष्ट झाली. भीतीने तोंड कोरडे पडले. छाती धडधडू लागली. तोंडातून शब्द फुटेनासा झाला. पण प्रसंगावधान राखून चाचरत चाचरत श्रीदासगणू म्हणाले, “बाबा, मी वाई-साताऱ्याकडील पांडववाडीचा राहणारा आहे. पोलिसबिलीस काही मला माहित नाही. समर्थांच्या जन्मभूमीचे दर्शन घ्यावे म्हणून जांबेस गेलो होतो. परत येताना आमच्या गावाकडे प्लेगची साथ असल्याचे कळले, म्हणून येथे राहिलो. माझे आयुष्यच सरले असेल तर त्याला तू तरी काय करणार? मार तुझ्या मनात आहे तर. मात्र एवढेच कर, मी आत जाऊन रामाच्या पायावर डोके ठेवतो, मागून तुझी बंदूक चालव”, असे म्हणून श्री दासगणूंनी गाभाऱ्यात धाव घेतली. प्रभू रामचंद्राच्या पायास घट्ट मिठी मारली आणि कळवळून म्हणाले, “रामा, तुझ्या आश्रयास आहे, योग्य वाटेल ते कर”. रामाच्या पायावर मस्तक टेकले आणि त्यांना मूर्च्छा आली. भक्तवत्सल श्रीरामचंद्र आपल्या दासाची उपेक्षा कशी करतील? कान्ह्यास काय वाटले कोण जाणे, रोखलेली बंदूक घेवून तो तसाच मागे फिरला. मंदिराच्या बाहेर आल्यावर त्याने पाटलाला बजावले, “या बुवास गावातून जाऊ देऊ नका. मी पुन्हा एकदा शोध काढून येतो”.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीरामरायानेच आपल्यास वाचविले असा श्रीदासगणूंचा निश्चय झाला. आता अधिकच काळजीपूर्वक हालचाली केल्या पाहिजेत हे त्यांच्या लक्षात आले. त्यांनी गुप्तपणे वरिष्ठांना पत्र लिहून स्वतःची चौकशी करविली. चौकशीसाठी आलेल्या पोलिस अधिकाऱ्याने त्यांची चांगलीच झडती घेतली व पाटलास म्हणाले, “हा कान्ह्याचा हस्तक दिसतो. पांडववाडीकडे आम्ही याची चौकशी करतो, तोवर यास येथून हलू देऊ नका”. या प्रकाराने पाटलाच्या व इतर लोकांच्या मनातील संशय पार नाहीसा झाला.',
                ),
                WidgetHelper.buildNormalText(
                  'पुढे एकदा श्री दासगणूंच्या गुप्त सूचनेनुसार पोलिसांनी कान्ह्या भिल्लाला पकडण्याचा प्रयत्न केला पण तो निसटून गेला. काव्यगत न्याय कसा असतो पहा, इकडे पाटलाची अशी धारणा झाली की रामदासी बुवांच्या कृपेमुळेच तो निसटू शकला. म्हणून नंतर पाटलाने कान्ह्यास बुवांच्या दर्शनास आणले. बुवांच्या पाया पडून त्याने आपल्या गळ्यातील १६ तोळे सोन्याचा सातपदरी हार बुवांना अर्पण केला. तो हार स्वीकारायला बुवांनी नम्रपणे नकार दिला. पण कान्ह्या तो हार परत घेईना. मग श्रीदासगणूंनी तो हार पाटलाच्या हाती दिला आणि म्हणाले, “यातले तीन पदर बाळंभटजीस द्या आणि बाकीचे मोडून या मोडकळीस आलेल्या मंदिराची डागडुजी करा”. पाटील आणि कान्ह्या दोघे थक्क झाले. असा निरिच्छ माणूस त्यांनी कधी पहिला नव्हता, ऐकलाही नव्हता.',
                ),
                WidgetHelper.buildNormalText(
                  'ही निरिच्छ वृत्ती श्रीदासगणूंची सहजवृत्ती होती. रामरायाच्या मनापासून केलेल्या सेवेने तिला बाळसे धरू लागले. त्यांनी श्रीवामनशास्त्रींची संपत्ती नाकारली, कान्ह्याने दिलेला सोन्याचा गोफ नाकारला, कधी लाच घेतली नाही. स्वतःची परिस्थिती अगदी बेताची असताना त्यांनी अगदी सहजपणे हे केले, हे विशेष होते. त्यांना जीवनात मिळवावयाचे होते ते दुसरेच! हे सोंग, त्यासाठी खोटे बोलणे, श्रीदासगणूंना आता नकोसे झाले. त्यांनी आपले स्नेही व महसूल खात्यातील वरिष्ठ अधिकारी श्रीनानासाहेब चांदोरकर यांना सांगून या जोखमीच्या कामातून स्वतःची सुटका करून घेतली व त्यांच्यापुरते कान्ह्या भिल्ल हे प्रकरण संपले.',
                ),
                Text(
                  'या सर्व घटनांचे अनुकूल परिणाम श्रीदासगणूंवर झाले. अनन्यभावे शरण आलेल्याची ईश्वर उपेक्षा करीत नाही, याचा अनुभव त्यांनी स्वतः घेतला. नश्वर अशा संसार सुखापेक्षा परमेश्वराच्या सेवेत प्राप्त होणारा आनंद किती मोठा असतो, ह्याचा प्रत्यय त्यांना आला. तसेच भजन-पूजन करणे, टिळे-माळा लावणे, लोकांनी पायावर डोके ठेवणे हे काही खऱ्या साधुत्वाचे चिन्ह नाही, संतांची लक्षणे काही निराळीच असली पाहिजेत, असा त्यांचा निश्चय झाला. अतिशय बुद्धिमान असे श्रीदासगणू आता त्या अनुषंगाने विचार करू लागले. त्यामुळे ईश्वरविषयक त्यांचे प्रेम वाढू लागले. लोणीस रामदासी वेषात असताना रोज श्रीविष्णुसहस्रनामाचे १२ पाठ करण्याचा जो नियम धरला होता, तो अखंड चालू राहिला. त्याचा परिणाम म्हणून ईश्वराविषयीचे अलोट प्रेम, अपार श्रद्धा हेच श्रीदासगणूंच्या जीवनाचा आधार बनले.',
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'या कान्ह्या भिल्लाच्या प्रकणातून सहीसलामत बाहेर पडल्यानंतर श्रीदासगणू अंतर्बाह्य बदलून गेले. आता त्यांच्या जीवनाच्या वाटचालीची दिशा संपूर्णतः बदलून गेली होती. सद्गुरू श्रीवामनशास्त्री इस्लामपूरकर यांचा अनुग्रह झालेला होताच. सद्गुरू श्रीवामनशास्त्री यांनी केलेल्या निर्देशानुसार व त्यांना स्वतःला आलेल्या अनेक अलौकिक अनुभवामुळे श्रीसाईबाबा यांचे ठायी त्यांची श्रद्धा दृढ होत गेली व पुढे बाबांच्या आदेशानुसार त्यांनी नोकरीचाही त्याग केला. श्री वामनशास्त्री यांची कृपा व श्रीसाईबाबांचे प्रत्यक्ष मार्गदर्शन यामुळे त्यांची वाटचाल अनेकांसाठी “सन्मार्ग दीपक” ठरणार होती, हे निश्चित!',
                ),
                WidgetHelper.buildNormalText(
                  '२६ नोव्हेंबर १९६२, सोमवार, या दिवशी वयाच्या ९४ व्या वर्षी श्रीदासगणू महाराजांनी आपला देह ठेवला. देह ठेवण्यापूर्वी काही तास अगोदर स्वतःच्या वयाच्या ३० व्या वर्षी घडलेले, त्यांच्या जीवनाला कलाटणी देणारे हे कान्ह्या भिल्लाचे संपूर्ण प्रकरण त्यांनी श्रीछगन काकांच्याकडून अगदी शांतपणे वाचून घेतले होते. या ‘कान्ह्या भिल्ल’ प्रकरणाचे श्रीदासगणू महाराजांच्या जीवनात किती अनन्यसाधारण महत्व होते, हे लक्षात यावे यासाठी एवढा उल्लेख पुरेसा आहे.',
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
