import 'package:flutter/material.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';

class KavyaParichayScreen extends StatelessWidget {
  const KavyaParichayScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'काव्यपरिचय'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  'संतकवी दासगणू महाराज यांच्या काव्याचा परिचय करून देणे ही एक अवघड गोष्ट आहे. याची मुख्यतः दोन कारणे आहेत. एक तर त्यांच्या काव्याचा विस्तार खरोखरीच एखाद्या सागराप्रमाणे विशाल आहे आणि गांभीर्याचा विचार करता समुद्राचीच उपमा शोभावी, असेच ते खोलही आहे. त्याचा थांग लावून आतील विचारमौक्तिके वर आणणे, हे अतिशय श्रमाचे आहे. कवित्वाच्या ज्या परंपरेचा उत्तराधिकार श्रीदासगणू महाराजांच्याकडे आला आहे, ती आज जनतेमध्ये लोकप्रिय असलेल्या परंपरेपेक्षा सर्वथैव वेगळी आहे. आजच्या कवींच्या संप्रदायामध्ये एक वेगळेच नावीन्य रूढ झाले आहे. ऐहिक वासनातृप्ती हे ज्यांचे ध्येय आहे त्या परकीय विचारसरणीचा पगडा आजच्या सुबुद्ध समाजावर पडलेला असल्यामुळे या परंपरेव्यतिरिक्त रचिल्या गेलेल्या साहित्याचे रसग्रहण करणे दुर्घट होऊन बसते. श्रीदासगणू महाराजांच्या काव्याचे परीक्षण करणे का अवघड आहे, त्याचे हे दुसरे पण एक महत्वाचे कारण आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराज संपूर्ण अर्थाने संतकवी आहेत. ते ज्या परंपरेचे उत्तराधिकारी आहेत, तिची गंगोत्री श्रीज्ञानेश्वरांच्या प्रतिभेत आहे आणि नामदेव, एकनाथ, तुकाराम, रामदास अशा एकाच क्षेत्रामध्ये उगम पावलेल्या, सारखेच मधुर व पवित्र जल असणाऱ्या अनेक प्रवाहांना समाविष्ट करून घेत, ही काव्यगंगा जनांचे पापताप फेडीत, तीरावरील तृषार्त पादपांना पोसत जनकल्याणासाठी प्रसन्नपणे अविरत वाहते आहे. आत्महित आणि जनहित साध्य करणे, समाजाचे अंतर्बाह्य स्वास्थ्य टिकविण्यासाठी नैतिक मूल्यांचा पुरस्कार करणे, जीवनासाठी कलेला राबविणे आणि त्यातच कलेचे सौंदर्य मानणे, हे या परंपरेचे साहित्यशास्त्र आहे. सौंदर्याचा अविष्कार हे येथे साधन आहे. शब्दातून प्रगट होणारा ध्वनी आणि त्या ध्वनीला पोषक होणारी रूपके ही मूळ अर्थाशी सर्व दृष्टीने संबद्ध असली पाहिजेत, असा या परंपरेचा भाषाशास्त्रविषयक दंडक आहे. हरिभक्तीची लेणी मिरविणे हे या परंपरेचे भूषण आहे. दंभ, लोभ, मत्सर अन् वासना यांना फटकारे मारून नियंत्रित ठेवणे ही या परंपरेची दंडनीती आहे आणि प्राचीन वेदांतमताप्रमाणे मोक्ष किंवा संतांच्या समाजोन्मुख तत्त्वज्ञानाच्या मांडणीप्रमाणे सगुण श्रीहरिची प्राप्ती हे या परंपरेचे परमधाम ध्येय, उद्दिष्ट, हेतू इत्यादी सर्व काही आहे. त्यासाठीच ती उगम पावते, वाहते आणि तेथेच तिचा लयही होतो.',
                ),
                WidgetHelper.buildNormalText(
                  'संतांचे बहुतेक वाङ्मय निश्चितपणे ‘काव्य’ या सदरात समाविष्ट होणारे आहे. ते पद्यमय तर आहेच, प्रसादगुण त्याचा आत्मा आहे आणि प्रतिभा विलासही त्यात ठायी ठायी आढळतो. त्यातील उपमारूपकातून हे सहज स्पष्ट होते. भावनेचा ओलावा, हे काव्याचे जीवन मानले; तर संत संप्रदायाची कविता ही भावाने थबथबलेली आहे. श्रीदासगणू महाराजांचे काव्य भक्ति व प्रेमरसाने ओथंबलेले आहे. तसेच ते जिव्हाळ्याचा बोध करणारे असल्याने प्रत्येकाला अंतर्मुख बनविते.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराज हे संतांच्या वाङ्मयपरंपरेचे आज तरी एक उत्तराधिकारी आहेत. जो हेतु, जे प्रयोजन संतांनी आपल्या डोळ्यासमोर ठेवले होते, तोच हेतू श्रीमहाराजांच्याही समोर आहे. त्यांच्या प्रसिद्ध झालेल्या वाङ्मयावर त्यांचा उल्लेख “संतकवी दासगणू” असा सविशेषण केला जातो. एकाने खोचून विचारले, “तुम्ही आपल्याला संतकवी म्हणवून घेता, हे अभिमानाचे द्योतक नाही काय?” यावर महाराज लगेचच म्हणाले, “यात अभिमानाचा काय संबंध? राजाचा कवी तो राजकवी, तसा संतांचा कवी तो संतकवी ! यात अभिमान कसला?” आयुष्यभर श्रीमहाराजांनी संतांच्या कीर्तीचे पोवाडे गाण्यापलिकडे दुसरे काही केलेच नाही, असे म्हटले तरी चालेल. संतांच्या दरबारामध्ये आपले स्थान फक्त वैतालिकाचे, स्तुतिपाठकाचे आहे, असेच श्रीदासगणू मानत.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराजांच्या काव्याची ओळख सर्व तऱ्हेने पटवून देण्याचे ‘संतकवी’ म्हणण्यामध्ये सामर्थ्य आहे. संतकवीपदाला शोभेल, असेच त्यांचे वर्तन व वाङ्मय आहे. श्रीहरिची प्राप्ती हा मुख्य हेतु बाजूला ठेवून केवळ कवित्वाचा दृष्टीने पहिले तरी, आधुनिकांना रंजविण्याचे सामर्थ्य त्यांच्या कवितेत निश्चितपणे आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराजांचे वाङ्मय हे एकांगी नाही. हृदयाच्या विशाल अनुभूतीमुळे त्यांच्या काव्याला आकर्षक अशी विविधता प्राप्त झाली आहे. एखाद्या रत्नाकराप्रमाणे उपमा, उत्प्रेक्षादी अलंकारांनी नटलेले असल्यामुळे ते रमणीय आहे. प्रसादगुण तर त्यात हापूस आंब्यामध्ये भरून राहिलेल्या रसाप्रमाणे वास करतो आहे. समजातील अनेक प्रकारच्या दंभाची त्यांना चीड आहे. समाजातील घटकांचे आपसातील भांडण त्यांच्या जिव्हारी लागले आहे. दलितवर्गाविषयी त्यांना कनवळा आहे. समाजाच्या उद्धारासाठी दृष्टेपणाने त्यांनी अनेक उपायही सांगितले आहेत. समाजातील चालीरीतींचे आणि विचारप्रवाहांचे सूक्ष्म निरीक्षण करून त्यावर योग्य, उपयुक्त टीकाही त्यांनी केली आहे. धार्मिक क्षेत्रातील पंडगिरी, एखाद्या सुधारकाप्रमाणे त्यांनाही तिरस्करणीय वाटते. बुवाबाजीचे तर त्यांनी आपल्या वाङ्मयात अक्षरशः वाभाडे काढले आहेत.',
                ),
                WidgetHelper.buildNormalText(
                  'या सर्व अंगोपांगांमुळे त्यांच्या वाङ्मयातील संतजनसुलभ भक्तीच्या जिव्हाळ्याला एक तऱ्हेची साधारण जनसामान्याला चाखता येईल, अशी आस्वाद्यता आली आहे. त्यांचे काव्य परतत्वाला स्पर्श करणारे तर आहेच पण त्या परतत्वाभोवती रसिकत्व आणि रसिकत्वाभोवती कवित्वाचे कोंदण असल्याने ते काव्य कोणालाही हवेसे वाटते आणि प्राप्यही आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराजांचे वाङ्मय विपुल आहे. त्या विशाल वाङ्मयात वृत्ते, छंद किंवा जाती यांचा वापरही विपुल आहे. त्यांची शब्दसंपत्ती चांगलीच संपन्न आहे. भक्तिरसायनासारखा अवघड विषय मांडतानांही त्यांना शब्द शोधीत बसावे लागत नाही. निरनिराळी वृत्तेही स्वबळावर चांगल्याप्रकारे हाताळता आली आहेत. त्यांच्या काव्यामध्ये (१) भूपाळी (२) काकडा (३) बालभोग (४) गोंधळ (५) उपदेशपरपदे (६) फटका (७) कटाव (८) गझल (९) झंपा (१०) लावणी (११) धुमाळी (१२) सूक्तिसंग्रह (१३) दिंड्या (१४) साकी (१५) आर्या (१६) कटिबंध (१७) छक्कड (१८) श्लोक - ओव्या (१९) विरहिण्या (२०) अभंग (२१) भजने (२२) भारूड (२३) पोवाडे इत्यादी साहित्यिक प्रकारांची रेलचेल आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराजांच्या कीर्तनोपयोगी आख्यानातील वर उल्लेखलेल्या साहित्यिक प्रकारातून प्रकट झालेल्या काव्याला, विविध पदांना कीर्तनातून गाण्यासाठी ज्या चाली दिल्या आहेत त्यातही विस्तृत प्रमाणात विपुलता आढळते. शास्त्रीय, उपशात्रीय, नाट्यसंगीत, भावगीतप्रधान, लोकसंगीत, बालगीते, इ. सर्वप्रकारच्या संगीताचा सुयोग्य वापर करून अगदी नेमकेपणाने व परिणामकारक चाली या पदांना लावल्या आहेत. त्यांची निवड व चपखल बांधणी पाहता आश्चर्याने थक्क व्हायला होते. त्या राग-रागिण्या अशा - (१) भैरव (२) अहिर भैरव (३) तोडी (४) आसावरी (५) जौनपुरी (६) जोग (७) जोगिया (८) मांडजोगी (९) भूप (१०) देसकार (११) भूपाळी (१२) पराग (१३) मधुवंती (१४) बिहाग (१५) बहार (१६) वसंत (१७) मारुबिहाग (१८) कानडा (१९) वसंतबहार (२०) मधुकंस (२१) दरबारी कानडा (२२) सोहोनी (२३) मारवा (२४) पटदीप (२५) भटीयार (२६) पहाडी (२७) सोरठ (२८) देस (२९) मालकंस (३०) जोगकंस (३१) चंद्रकंस (३२) केदार (३३) खमाज (३४) झिंजोटी (३५) काफी (३६) भीमपलास (३७) बागेश्री (३८) रागेश्री (३९) कालिंगडा (४०) गरुडध्वनि (४१) सिंधकाफी (४२) करूण भैरवी (४३) पुरिया (४४) जयजयवंती (४५) मालगुंजी (४६) मुलतानी (४७) सारंग (४८) मेघमल्हार (४९) मियामल्हार (५०) अडाणा (५१) कलावती (५२) ठुमरी (५३) यमन (५४) पिलू (५५) अभंग (५६) हिंडोल (५७) लावण्या (५८) छक्कड (५९) गझल (६०) सवाल (६१) खडी गझल (६२) पोवाडे (६३) फटके (६४) ओवी (६५) दिंडी (६६) साकी (६७) कटाव (६८) भलरी (६९) श्लोक (७०) सवाई (७१) भैरवी या व इतर अनेकविध रागांचे कीर्तनातून प्रकटीकरण होते.',
                ),
                WidgetHelper.buildNormalText(
                  'या सर्व राग-रागिण्यांबरोबर तबल्याचे ठेकेही ठरलेले आहेत. (१) धुमाळी (२) दादरा (३) एकताल (४) त्रिताल (५) द्रुत त्रिताल (६) धृपद (७) केहरवा (८) दीपचंदी (९) पंजाबी (१०) झपताल (११) भजनी ठेका (१२) कव्वाली ठेका (१३) रूपक या विविध तालांमुळे आणि झांजाच्या ठेक्यात कीर्तनाचा रंग, आनंद पाहून श्रोते डुलू लागतात.',
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
