import 'package:flutter/material.dart';
import 'package:flutter_svg/svg.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/routes/app_routes.dart';
import 'package:varadvani/theme/color_code.dart';

class PoorvardhaScreen extends StatelessWidget {
  const PoorvardhaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'पूर्वार्ध'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                Column(
                  spacing: 15,
                  children: [
                    Text(
                      'जन्म व बालपण',
                      style: TextStyle(
                        fontSize: 20,
                        fontFamily: 'Mukta',
                        fontWeight: FontWeight.bold,
                        color: Color(ColorCode.black),
                        letterSpacing: 0,
                        height: 1.5,
                      ),
                    ),
                    WidgetHelper.buildNormalText(
                      'कोकणातील कोतवडे, जि. रत्नागिरी हे सहस्रबुद्धे घराण्याचे मूळ गाव. तथापि उदरनिर्वाहासाठी हे घराणे नगरला स्थायिक झाले. अंगभूत कर्तबगारीच्या बळावर मामलेदारीचे काम त्यांनी मिळवले. श्री दासगणू महाराजांच्या तीन पिढ्या आधीपासून त्यांच्या घरात मामलेदारी होती. त्यांच्या परिवाराला त्या परिसरात मोठा मान व प्रतिष्ठा होती. श्री. एकनाथ व सौ. सरस्वती हे दासगणूंचे आजोबा व आजी तर श्री. दत्तात्रेय व सौ. सावित्री हे त्यांचे पिता व माता ! शके १७८९, पौष शुद्ध एकादशी (दि.०६ /०१/१८६८) या मंगल दिवशी सूर्योदयाच्या वेळी आकोळनेर येथे (आजोळी) दाभोळकरांकडे श्री दासगणू महाराजांचा जन्म झाला. सूर्योदयाच्या वेळी जन्म झाला म्हणून बाळाचे नाव “नारायण” ठेवले होते. तथापि बाळ जेव्हा आजोळहून नगरला सहस्रबुद्धे यांच्या घरी आला तेव्हा बाळाचे आजोबा म्हणाले, “याचे कान व पोट गणपती सारखे आहे. आपण याला ‘गणेश’ म्हणूया”. म्हणून ‘गणेश’ हेच नाव रूढ झाले. ‘गणेश’चे पुढे ‘गणू’ झाले. महाराज स्वतःला संतांचा दास म्हणवून घेत असत. म्हणून ‘दासगणू’ हे नामाभिधान प्रचलित झाले.',
                    ),
                    WidgetHelper.buildNormalText(
                      'घरची श्रीमंती असल्याने बालपण खूप समृद्धीत व्यतीत झाले. पहिला-वहिला नातू म्हणून आजोबा व आजी यांनी त्यांचे खूप लाड केले. नवव्या वर्षी मुंज झाल्यावर चि. गणेशाचे नाव शाळेत दाखल झाले. सहस्रबुद्धे यांच्या घरातील वातावरण सुशिक्षितांचे होते पण सर्वसामान्यपणे समाजात आज आपण घेतो तशा शिक्षणाचे आकर्षण नव्हते. लिहिता-वाचता आले, थोडीफार बेरीज-वजाबाकी करता आली म्हणजे पुरे, अशी मनोभूमिका असणारा तो काळ होता. समृद्धी असल्याने नोकरीसाठी शिक्षण ही दृष्टीच नव्हती. शेतीवर पालन-पोषण व धार्मिक आचार-विचार यांनी मनाची मशागत त्या काळी होत असे. स्वाभाविकच योग्य वयात शाळेत न घातल्याने अभ्यासाची गोडी लागली नाही. चुलत्याने खूप प्रयत्न करूनहि इंग्रजी चौथी पर्यंतच दासगणू महाराजांचे शिक्षण झाले.',
                    ),
                    WidgetHelper.buildNormalText(
                      'वर्गात इतर मुले लहान वयाची, त्यात वयाने मोठा असलेला मुलगा सामावू शकत नाही त्यामुळे समवयस्क मुलांत दासगणू मिसळू लागले. तसा दासगणूंचा स्वभाव आनंदी पण मिश्किल होता. मिश्किल स्वभावामुळे उनाडक्या करणे, टिंगल-टवाळी करणे याकडे त्यांचा कल वाढू लागला. शब्दांची जुळणी करून काव्यात्मक शैलीत एखाद्या विषयावर उपहासात्मक भाष्य करणे, ही कला त्यांच्या अंगी उपजत होती. परिणामतः त्याकाळाचे मनोरंजनाचे एकमेव साधन ‘तमाशा’ या क्षेत्राकडे त्यांचे पाय वळले. त्या काळात राम जोशी, अनंत फंदी यांच्या बऱ्याच रचना तमासगीर सादर करीत असत. तमाशातील गाणी ऐकून त्यांच्याही जन्मजात काव्य प्रतिभेला पंख फुटले व ती ह्या लोककलेच्या नभांगणात मुक्तपणे विहार करू लागली. कधी ती प्रतिभा निर्भेळ शृंगाराचे उत्तान वर्णन करी, तर कधी निसर्ग सौंदर्याचा आस्वाद घेत जोंधळा-बाजरीचे लग्न लावी. कधी संतांचे गुणानुवाद तर कधी लब्धप्रतिष्ठितांची कुलंगडी फटकळपणे चव्हाट्यावर आणून झुळझुळीत पडद्यामागचे अनाचाराचे दर्शन घडवी. अशी कितीतरी मनोरंजन करणारी कवने ते लिहू लागले अन् तमासगिरांचे ‘अन्नदाते’ बनले.',
                    ),
                    WidgetHelper.buildNormalText(
                      'आपल्या मामलेदार घराण्यातील या तरण्याताठ्या मुलाचे तमासगिरात वावरणे दासगणू महाराजांच्या आईला पटत नव्हते. म्हणून लग्नाची बेडी (शके १८१३ मध्ये वयाच्या २४ व्या वर्षी बोरले आष्टा, जामखेड, येथील जहागीरदार श्री नारायणराव रानडे यांची कन्या सरस्वती यांचेशी पुण्यात त्यांचे लग्न झाले) पायात अडकवून दासगणू महाराजांची रवानगी बडोदा संस्थानात कारकुनाच्या जागेवर केली गेली. पण संस्थानिकांपुढे लाचारीने वागणे स्वाभिमानी स्वभावाच्या दासगणूंना आवडले नाही. नोकरी सोडून ते पुन्हा नगरला आले व तमासगिरांत मिसळू लागले. घरातील मंडळींना हे रुचले नाही व त्यातच एकदा जेवणावरून चुलतीने त्यांचा अपमान केला. तेव्हा स्वाभिमानी दासगणूंनी स्वतःच्या घराचाही त्याग केला. आपल्या पोटापाण्याची सोय आता आपणच पहिली पाहिजे या विचारात भटकत असताना एका एम. केनेडी नावाच्या इंग्रजी पोलीस अधिकाऱ्याच्या ते दृष्टीस पडले. शरीराने सुदृढ व उंचपुऱ्या असलेल्या दासगणूंना त्या अधिकाऱ्याने पोलीस खात्यात रु.९/- इतक्या मासिक वेतनावर हवालदार पदावर भरती केले. ज्या घराण्यातील कर्त्या पुरुषांना पोलीस हवालदाराने सलाम ठोकायचा, त्याच घरातील तरुण मुलाने अशी हलकी नोकरी पत्करली, हे घरच्यांना मुळीच आवडले नाही. त्यामुळे आईवडिलांनी, चुलत्यांनी ही कमी दर्जाची नोकरी सोडून दुसरी चांगली नोकरी पत्करण्यासाठी व घरी परत येण्यासाठी मन वळविण्याचा खूप प्रयत्न केला. पण घरातील अपमानाने मन दुखावलेल्या स्वाभिमानी दासगणू महाराजांचा निश्चय मुळीच ढळला नाही. श्री. गणेश दत्तात्रेय सहस्रबुद्धे, बक्कल नंबर ७२७ अशी सरकारी दरबारी नोंद होऊन महाराज नोकरीच्या ठिकाणी श्रीगोंदा येथे रुजू झाले.',
                    ),
                  ],
                ),
                Column(
                  spacing: 15,
                  children: [
                    Text(
                      'काव्याला नवे वळण',
                      style: TextStyle(
                        fontSize: 20,
                        fontFamily: 'Mukta',
                        fontWeight: FontWeight.bold,
                        color: Color(ColorCode.black),
                        letterSpacing: 0,
                        height: 1.5,
                      ),
                    ),
                    WidgetHelper.buildNormalText(
                      'सोलापूरच्या राम जोशींना जसे मोरोपंत लाभले व त्यांनी हातातील डफ काढून घेवून राम जोशींच्या गळ्यात वारकऱ्यांची वीणा घातली व त्यांच्या प्रतिभेला भक्तीच्या मळ्याची वाट दाखविली; तसेच जसे अनंत घोलप, मलिक फंदीच्या सहवासाने अनंत फंदी झाले. तद्वत वळण दासगणूंच्या काव्य प्रतिभेला मिळाले. त्या वेळी दासगणू महाराजांची बदली जामखेडला झाली होती. तेथील विठ्ठल मंदिरात दर एकादशीला कीर्तन होत असे. एका एकादशीला कीर्तनकार आलेच नाहीत त्यामुळे कीर्तन झाले नाही, ही गोष्ट जामखेडचे मामलेदार शेटफळकरांच्या मनाला फार लागली. योगायोगानेच दुसऱ्या दिवशी दासगणू महाराज भेटताच ते त्यांना म्हणाले, “गणपतराव, लावण्या-पोवाडे रचण्यात बुद्धीचा अपव्यय करतोस, त्या ऐवजी संतांची आख्याने रचलीस तर तुझ्या प्रतिभेचे सार्थक होईल”. हे आव्हान दासगणूंनी स्वीकारले व “पुढच्या एकादशीला मीच कीर्तन करीन” असा शब्द दिला. अन् खरेच “श्रीसंत दामाजीचे आख्यान” स्वतःच रचले. तमाशात जे साथीदार लावण्या म्हणत असत त्या हयात खान नावाच्या मुसलमान सद्गृहस्थाकडून ते चांगले पाठ करून घेतले व राहिले कीर्तनाला उभे ! हृदयाची ठाव घेणारी भाषा, ऐकणाऱ्याच्या समोर चित्र उभे करणारे शब्दसौष्ठव, भक्तीने ओथंबलेले मन, साधी पण सुसंबद्ध कथा मांडणी आणि या सर्वांच्या जोडीला स्वकृत भावपूर्ण काव्य व त्याचे विवेचन यामुळे कीर्तन असे रंगले की चार तास कसे गेले कोणाला कळलेच नाही. ‘गणपतराव दिसतो त्यापेक्षा खूपच वेगळा आहे’ अशा तऱ्हेने कौतुक करीत लोक आणि स्वतः शेटफळकरही प्रसन्नतेने घरी गेले. शृंगाराच्या क्षेत्रात रमणाऱ्या काव्य प्रतिभेला भक्तीचे क्षेत्र मिळाले व परमेश्वराचे गुणानुवाद ती गाऊ लागली. पुढे तिला दायित्वाचे भान मिळाले याला कारण शिर्डीच्या सद्गुरू साईबाबा यांची आज्ञा ! त्यांच्या आज्ञेनुसार दासगणू महाराजांनी दीडशेहून अधिक संतांची ओवीबद्ध चरित्रे लिहिली. ‘भक्तिलीलामृत’, ‘संतकथामृत’ व ‘भक्तिसारामृत’ या तीन ग्रंथात ही ओवीबद्ध चरित्रे आहेत. प्रत्येक संतांच्या जन्मगावी जावे, माहिती गोळा करावी व मग ओव्या रचाव्यात; त्यामुळे त्यांच्या चरित्र लेखन पद्धतीला पुढे एक ऐतिहासिक संदर्भ म्हणून महत्व प्राप्त झाले.',
                    ),
                    WidgetHelper.buildNormalText(
                      'पुढच्या काळात त्यांनी अनेक आख्याने लिहिली व ती गावून कीर्तने केली व अवघा महाराष्ट्र त्यांनी भक्तिरसात रंगविला. श्रीदासगणू महाराजांनी जवळपास ८५ कीर्तनोपयोगी आख्याने रचली आहेत. श्रीदासगणू महाराजांचे सर्वच वाङ्मय भक्तिरसप्रधान आहे. संतांची चरित्रे गाण्यातच त्यांनी आपल्या प्रासादिक काव्यप्रतिभेचा वापर केला. श्रीमहाराजांनी रचलेल्या ओव्यांची संख्या १.५ लाखांपेक्षाही अधिक आहे. त्यांनी निर्माण केलेल्या ग्रंथांपैकी अमृतानुभव भावार्थमंजिरी, पासष्टीभावार्थदीपिका, श्रीगुरूचरित्र सारामृत, श्रीगोदामाहात्म्य, श्रीगौडपादकारिका, श्रीईशावास्य भावार्थबोधिनी व मंत्रार्थप्रकाशिका, श्रीनागझरी माहात्म्य, श्रीनारद-भक्तिसूत्र-बोधिनी, श्रीमध्वविजय, श्रीमांगीशमाहात्म्य, श्रीशनिप्रताप, श्रीशंडिल्यभक्तिसूत्र भावदीपिका, आद्यशंकराचार्य चरित्रग्रंथ, शेगावच्या श्रीगजानन महाराजांच्या लीलाचरित्र वर्णन असलेला ‘श्रीगजाननविजय’ हे प्रमुख ग्रंथ त्यांच्या भक्तिरसप्रधान, रसाळ, प्रासादिक व उत्तुंग काव्यप्रतिभेची साक्ष पटवितात.',
                    ),
                  ],
                ),
                InkWell(
                  onTap: () => Navigator.pushNamed(
                    context,
                    AppRoutes.kavyaParichayScreen,
                  ),
                  child: Container(
                    width: double.infinity,
                    decoration: BoxDecoration(
                      color: Color(ColorCode.white),
                      boxShadow: [
                        BoxShadow(
                          color: Color(ColorCode.black).withValues(alpha: 0.04),
                          blurRadius: 5,
                          spreadRadius: 1,
                          offset: Offset(0, 1),
                        ),
                      ],
                      borderRadius: BorderRadius.all(Radius.circular(12)),
                    ),
                    child: Padding(
                      padding: const EdgeInsets.symmetric(
                        horizontal: 20,
                        vertical: 15,
                      ),
                      child: Row(
                        mainAxisAlignment: MainAxisAlignment.spaceBetween,
                        crossAxisAlignment: CrossAxisAlignment.center,
                        children: [
                          Flexible(
                            flex: 8,
                            child: Text(
                              'श्रीमहाराजांच्या कीर्तनोपयोगी आख्यानातील काव्याचा साहित्यिक व सांगीतिक परिचय',
                              style: TextStyle(
                                fontSize: 18,
                                fontFamily: 'Mukta',
                                color: Color(ColorCode.orange),
                                letterSpacing: 0,
                                height: 1.5,
                              ),
                            ),
                          ),
                          Flexible(
                            flex: 2,
                            child: SvgPicture.asset(
                              'assets/svg/arrow.svg',
                              colorFilter: ColorFilter.mode(
                                Color(ColorCode.black),
                                BlendMode.srcIn,
                              ),
                            ),
                          ),
                        ],
                      ),
                    ),
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
