import 'package:flutter/material.dart';
import 'package:flutter_svg/svg.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/routes/app_routes.dart';
import 'package:varadvani/theme/color_code.dart';

class UttarardhaScreen extends StatelessWidget {
  const UttarardhaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'उत्तरार्ध'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 20,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  'श्रीसाईबाबांच्या आदेशान्वये नोकरीचे त्यागपत्र देऊन १९०५ साली दासगणू नांदेडकडे आले. प्रत्यक्ष ओळख नसताना पण जन्मोजन्मीचे ऋणानुबंध असल्यागत नांदेडच्या पुंडलिकवाडीतील प्रतिष्ठित वकीलद्वय श्री. पुंडलिकराव दत्तात्रेय नांदेडकर व श्री. धोंडोपंत दत्तात्रेय नांदेडकर यांच्याशी त्यांचा संबंध जुळून आला. नंतर पुढच्या पिढीत नातेसंबंध जुळून येऊन हे ऋणानुबंध अधिकच घट्ट झाले. नांदेड, परभणी, छत्रपती संभाजीनगर, जालना, हिंगोली, मुखेड, देगलूर, कळमनुरी, वसमत, उमरी या गावात व त्या परिसरात दादांच्या कीर्तनाचा सुगंध झपाट्याने पसरू लागला व त्यांना गुरुस्थानी मानणारा एक मोठा वर्ग येथे तयार झाला.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/vitthal.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  '१९३८ साली एकदा नांदेडच्या जवळ उमरी येथे एका मंदिरात श्रीरुक्मिणीपांडुरंगाच्या मूर्तींची प्राणप्रतिष्ठापना करण्यासाठी दादांना आमंत्रित केले होते. त्यावेळी दादांची कीर्तनेही झाली होती. पंचक्रोशीतील आजूबाजूच्या गावातूनही बरीच मंडळी या कार्यक्रमासाठी जमली होती. त्यात एक होत्या गोरट्याच्या आदरणीय आनंदीबाई देशमुख! संपूर्ण गोरटे गावाला त्या मातृस्थानी वंदनीय होत्या. त्यांच्या उदारवृत्तीची ख्याती सर्वदूर पसरलेली होती. पंचक्रोशीतील गावकऱ्यांच्या अडीअडचणीत त्या धावून जात. महाराजांची भक्तिरसपूर्ण कीर्तने एकूण त्या खूप भारावून गेल्या होत्या. त्यांनी महाराजांचा अनुग्रह स्वीकारला व पुढे स्वतःच्या मुलाला सांगून महाराजांना आग्रहाने स्वतःच्या घरी गोरट्याला आणले. महाराजांनाही छोटेसे, टुमदार, निसर्गरम्य, निरव शांतता असलेले हे गोरटे गाव खूपच आवडले. त्यांचे गोरट्यात येणे वाढले. ‘जेथे राजा, तेथे राजधानी’ या न्यायाने भाविकभक्तांचीही गोरट्यात वर्दळ वाढू लागली. देशमुखांचा प्रशस्त मोठा वाडा कमी पडू लागला. या सर्वांची गैरसोय टाळण्यासाठी आनंदीबाईंनी गावाला अगदी खेटून असलेल्या स्वतःच्या शेतात दोन मोठ्या खोल्या बांधून दिल्या व पुढे दातृत्वाची परिसीमा गाठून ते सर्वच शेत महाराजांच्या नावे करून टाकले. त्याच जागी आज प्रतिष्ठानची भव्य वास्तू उभी आहे. प्रतिष्ठानच्या आवारात असलेल्या श्रीरुक्मिणीपांडुरंग व श्रीशनिदेवाची महाराजांच्या उपस्थितीतच प्राणप्रतिष्ठापना झाली आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'विजयादशमीच्या (दि.१५/१०/१९१८) दिवशी शिर्डीत श्रीसाईबाबांनी देह ठेवला. हा अजून एक मोठा आघात दासगणूंना पचवावा लागला. श्रीसाईभक्तांच्या आग्रहाखातर १९२२ साली शिर्डीत श्रीसाई संस्थान स्थापन झाले व या संस्थानच्या प्रथम अध्यक्ष पदाची जबाबदारी श्रीदासगणू महाराजांवर सोपविण्यात आली. पुढे हे दायित्व दासगणूंनी ३९ वर्षे श्रद्धापूर्वक सेवाभावाने यशस्वीरीत्या सांभाळले. तत्पूर्वी बाबांच्या उपस्थितीतच १८९७ साली श्रीरामनवमीचा उत्सव दासगणूंनी सुरु केला होता. आज श्रीसाई संस्थानच्या प्रमुख उत्सवांपैकी हा एक उत्सव आहे. तीन दिवस दासगणू परंपरेची कीर्तने येथे केली जातात व कीर्तन सादर करण्याची सेवा आजही दासगणूंच्या परंपरेतील कीर्तनकाराला दिली जाते.',
                ),
                WidgetHelper.buildNormalText(
                  'सन्नीती, सद्वासना व सद्विचार या सद्गुणांची समाजात जोपासना होऊन त्यांत वाढ होण्यासाठी कीर्तन हे माध्यम श्रीदासगणू महाराजांनी खूप प्रभावीपणे वापरले. आयुष्यभर दादांनी संतचरित्रे गायली. त्यासाठी त्यांनी भरपूर प्रवास केला, माणसं जोडली. पण जसे त्यांचे वय वाढत होते तसे त्यांचा प्रवास कमी होऊन गोरटे, पंढरपूर, पुणे व लोणावळा या गावी मुक्काम वाढू लागला. १९३७ साली लोणावळ्यातील श्रीराममंदिरात त्यांनी गंगादशहराचा उत्सव सुरु केला. गोरटे संस्थानच्या प्रमुख उत्सवापैकी हा एक उत्सव आजही अत्यंत भक्तिभावाने साजरा केला जातो. अपार श्रद्धेपोटी दासगणूंनी बऱ्याच संतांच्या जयंती व पुण्यतिथीस्मरण उत्सव सुरु केले होते. ते सर्व उत्सव व महोत्सव त्याच प्रेमादरयुक्त श्रद्धेने प्रतिवर्षी श्रीदासगणू प्रतिष्ठानच्या वतीने साजरे केले जातात. दर तीन वर्षाने येणारा ‘पुरुषोत्तम मास’ दासगणू महाराज अत्यंत धार्मिकतेने संपन्न करीत असत. अप्पांच्या वेळीही या पुरुषोत्तम मासाच्या उत्सवाचे अनन्यसाधारण महत्व असायचे. वर्तमान काळी गोरटे संस्थानचा हा एक प्रमुख उत्सव आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदासगणू महाराजांचे सर्वच वाङ्मय भक्तिरसप्रधान आहे. संतांची चरित्रे गाण्यातच त्यांनी आपल्या प्रासादिक काव्यप्रतिभेचा वापर केला. त्यांनी निर्माण केलेल्या ग्रंथांपैकी अमृतानुभव भावार्थमंजिरी, पासष्टीभावार्थदीपिका, श्रीगुरूचरित्रसारामृत, श्रीगोदामाहात्म्य, श्रीगौडपादकारिका, श्रीईशावास्य भावार्थबोधिनी व मंत्रार्थप्रकाशिका, श्रीनागझरीमाहात्म्य, श्रीनारद-भक्तिसूत्र-बोधिनी, श्रीमध्वविजय, श्रीमांगीशमाहात्म्य, श्रीशनिप्रताप, श्रीशंडिल्यभक्तिसूत्र भावदीपिका हे प्रमुख ग्रंथ त्यांच्या उत्तुंग काव्यप्रतिभेची साक्ष पटवितात. आद्यशंकराचार्यांच्या जीवनावरील रचलेला ओवीबद्ध चरित्रग्रंथ व घराघरांत पोहोचलेला, शेगावच्या श्रीगजानन महाराजांच्या लीलाचरित्र वर्णन असलेला ‘श्रीगजाननविजय’ हा ग्रंथ म्हणजे श्रीशारदेच्या स्कंधावर रुळणारी दोन दैदिप्यमान रत्ने आहेत. ‘श्रीगजाननविजय’ हा ग्रंथ दादांनी वयाच्या ७२ व्या वर्षी तर श्रीशंकराचार्यांचे चरित्र वयाच्या ७४ व्या वर्षी लिहून पूर्ण केले. ',
                ),
                WidgetHelper.buildNormalText(
                  'श्रीदादांचे ९४ वयोमानाचे अवघे जीवन म्हणजे कृतार्थतेचा एक उत्सवच होता. प्रसिद्धीपराङ्मुखता हा गुणविशेष त्यांनी आयुष्यभर जपला व स्वतःचा कधी उदोउदो होऊ दिला नाही. तथापि त्यांच्या वयाच्या ९०व्या वर्षी पुण्यश्लोक अहिल्यानगरच्या नगरपालिकेच्या वतीने १९५८ मध्ये त्यांचा सत्कार आयोजिला होता. तहयात प्रसिद्धीला दूर ठेवणाऱ्या श्रीदादांनी हा सत्कार मात्र सहर्ष स्वीकारला. “नगरच्या लोकांनी मला जोडे मारले तरी ते मला सत्कारा इतकेच प्रिय आहेत, आज तर तुम्ही मला हारतुरे घालीत आहात!” व तसेच “माझ्या ठायी ‘आयुष्यभरात एकही सत्कार मी स्वीकारला नाही’ ही अहंकाराची सुप्त भावनाही शिल्लक राहू नये, यासाठी माझ्या जन्मभूमीने केलेला हा सत्कार मी नम्रपणे स्वीकारीत आहे”, अशी भावना त्यांनी या सत्काराच्या वेळी व्यक्त केली. जीवनातील एकमेव सत्कार स्वीकारण्यामागची त्यांची ही भावना त्यांच्यातील संतत्वाला प्रगट करते. लावण्या रचणारा एक शाहीर, श्रीवामनशास्त्री यांच्या कृपेने व श्रीसाईबाबांच्या आशीर्वादाने संतकवी होतो काय, संतांची चरित्रे गाताना त्यांच्या जीवनातील उदात्त दिव्यत्वाचा स्पर्श झालेली जीवनतत्वे अगदी सहजपणे स्वतःच्या जीवनात कशी उतरवावीत याचा जनसामान्यांसाठी एक आदर्श उभा करतो काय व स्वतःही संतपदी पोहोचतो काय, सारे काही अलौकिक व दिव्य!',
                ),
                WidgetHelper.buildNormalText(
                  'दादा आता खूप थकत चालले होते. प्राणप्रिय गोदेच्या काठी देह पडावा व श्रीपांडुरंगाने चरणी जागा द्यावी, इतकीच आस आता शिल्लक होती. श्रीविठ्ठलाची भक्ती करण्यासाठी व संतचरित्रांतील सुगंध सर्वांना वाटण्यासाठी स्वतःचे आयुष्य चंदनाप्रमाणे झिजविणाऱ्या आपल्या या लडिवाळ भक्ताची ही आस भक्तवत्सल श्रीपांडुरंगाने सानंद मान्य केली. शके १८८३, कार्तिक वद्य त्रयोदशीला म्हणजेच संतश्रेष्ठ श्रीज्ञानेश्वर महाराजांच्याच पुण्यतिथीच्या दिवशी (सोमवार, दि.२६/११/१९६२) श्रीविठ्ठलाने आपल्या या निष्ठावंत भक्ताला पंढरपुरातच स्वतःच्या चरणी विसावा दिला. महाराज पंचतत्वात विलीन झाले.',
                ),
                Text(
                  'भक्तीत अंतर तुझ्या कधीहि नसावे l \nमागे पुढे आमुचिया विठू तू असावे ll \nत्वा भक्तवत्सल अशा धरिलेस नावा l \nया दीन दासगणूला पदी दे विसावा ll',
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                InkWell(
                  onTap: () => Navigator.pushNamed(
                    context,
                    AppRoutes.gajananMaharajScreen,
                  ),
                  child: Container(
                    width: double.infinity,
                    decoration: BoxDecoration(
                      color: Color(ColorCode.white),
                      boxShadow: [
                        BoxShadow(
                          color: Color(ColorCode.black).withValues(alpha: 0.04),
                          blurRadius: 5,
                          spreadRadius: 1,
                          offset: Offset(0, 1),
                        ),
                      ],
                      borderRadius: BorderRadius.all(Radius.circular(12)),
                    ),
                    child: Padding(
                      padding: const EdgeInsets.symmetric(
                        horizontal: 20,
                        vertical: 15,
                      ),
                      child: Row(
                        mainAxisAlignment: MainAxisAlignment.spaceBetween,
                        crossAxisAlignment: CrossAxisAlignment.center,
                        children: [
                          Flexible(
                            flex: 8,
                            child: Text(
                              '‘श्रीगजाननविजय’ या ग्रंथाच्या निर्मितीचा इतिहास',
                              style: TextStyle(
                                fontSize: 18,
                                fontFamily: 'Mukta',
                                color: Color(ColorCode.orange),
                                letterSpacing: 0,
                                height: 1.5,
                              ),
                            ),
                          ),
                          Flexible(
                            flex: 2,
                            child: SvgPicture.asset(
                              'assets/svg/arrow.svg',
                              colorFilter: ColorFilter.mode(
                                Color(ColorCode.black),
                                BlendMode.srcIn,
                              ),
                            ),
                          ),
                        ],
                      ),
                    ),
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
