import 'package:dotted_line/dotted_line.dart';
import 'package:flutter/material.dart';
import 'package:varadvani/data/table_data.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class AppaGranthSampadaScreen extends StatelessWidget {
  const AppaGranthSampadaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'पू. अप्पांची ग्रंथसंपदा'),
      body: SafeArea(
        child: Padding(
          padding: const EdgeInsets.only(
            right: 20,
            left: 20,
            top: 10,
            //bottom: 15,
          ),
          child: Column(
            spacing: 20,
            mainAxisSize: MainAxisSize.min,
            children: [
              WidgetHelper.buildStartText(),
              Expanded(
                child: Column(
                  children: [
                    WidgetHelper.tableHeader(
                      TableData('ग्रंथाचे नाव', 'माहिती', 'मूल्य'),
                      0.7,
                      1.5,
                      0.5,
                    ),
                    Expanded(
                      child: ListView.separated(
                        itemCount: booksData.length,
                        itemBuilder: (context, index) {
                          final member = booksData[index];
                          return Padding(
                            padding: EdgeInsets.only(
                              top: index == 0 ? 10 : 0,
                              bottom: index == booksData.length - 1 ? 15 : 0,
                            ),
                            child: WidgetHelper.buildTable(
                              member,
                              0.6,
                              1.4,
                              0.5,
                            ),
                          );
                        },
                        separatorBuilder: (context, index) => Padding(
                          padding: const EdgeInsets.only(top: 10, bottom: 10),
                          child: DottedLine(
                            dashLength: 4,
                            dashColor: Color(
                              ColorCode.darkGray,
                            ).withValues(alpha: 0.15),
                          ),
                        ),
                      ),
                    ),
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}

List<TableData> booksData = [
  TableData(
    "अनुवाद ज्ञानेश्वरी (ओवीबद्ध)",
    "मूळ ज्ञानेश्वरी ग्रंथाचा रसप्रवाह अबाधित ठेवून सुलभ मराठीत केलेला प्रासादिक अनुवाद",
    "300/-",
  ),
  TableData(
    "अप्रकाशित वाङ्मय (गद्यखंड)",
    "स्वामीजींचे यात्रा वर्णन, तात्विक निबंध टीकात्मक/आयुर्वेदीय/आत्मकथनपर इ. अप्रकाशीत गद्य लेखन",
    "150/-",
  ),
  TableData(
    "अप्रकाशित वाङ्मय (पद्यखंड)",
    "स्वामीजींचे चिंतनपर, उपदेशपर, वर्णनपर, राष्ट्रीय विचारपर अप्रकाशित काव्य",
    "120/-",
  ),
  TableData(
    "अष्टाङ्ग संग्रह",
    "आयुर्वेदाच्या अभ्यासकांना अत्यंत उपयुक्त असा एक प्रधान ग्रंथ",
    "1000/-",
  ),
  TableData(
    "आत्मानुसंधान",
    "श्रीशंकराचार्यांच्या योगतारावली (ओवीबद्ध) व परापूजा (गद्य) या दोन प्रकरणग्रंथावरील विवेचन",
    "15/-",
  ),
  TableData(
    "आयुर्वेदीय व्याविनिश्र्चय",
    "आयुर्वेदीय रोगनिदान, कायचिकित्सा",
    "800/-",
  ),
  TableData(
    "खंड १ ला (गद्य)",
    "ईशावास्य व मांडुक्य उपनिषदे (गौडपादकारिकांसह)",
    "150/-",
  ),
  TableData(
    "खंड २ रा (ओवीबध्द)",
    "केन, कठ, प्रश्न, मुंडक, ऐतरेय, तैत्तिरीय ही सहा उपनिषदे",
    "350/-",
  ),
  TableData("खंड ३ रा (ओवीबध्द)", "छांदोग्योपनिषद", "300/-"),
  TableData("खंड ४ था (गद्य)", "बृहदारण्यकोपनिषद", "240/-"),
  TableData(
    "खंड ५ वा (ओवीबध्द)",
    "श्वेताश्वतर व श्रीमहानारायण उपनिषदे आणि उपनिषद विषयक काही महत्वाची प्रश्नोत्तरे (संग्रहीत)",
    "260/-",
  ),
  TableData(
    "तैत्तिरीय उपनिषद (ओवीबध्द)",
    "खंड २ मधून पारायणासाठी छापलेली प्रत",
    "50/-",
  ),
  TableData(
    "कथा संस्काराच्या-संस्कृतीच्या",
    "संस्कार व संस्कृतीच्या कथांचे संकलन",
    "30/-",
  ),
  TableData(
    "कनकधारा स्तोत्र",
    "श्रीशंकराचार्य विरचित लक्ष्मीस्तोत्रावरील स्वामीजींचे विवेचन",
    "15/-",
  ),
  TableData(
    "करुणानिधे",
    "स्वसंस्कृती, स्वभाषा, स्वधर्म आणि स्वदेश याबद्दल जाज्वल्य स्वाभिमान करणारे भाष्य",
    "10/-",
  ),
  TableData(
    "कालिके स्मरुनी पाया",
    "शालिवाहन काव्यातील प्रथम सर्ग व गद्य श्लोकार्थासह युवकांसाठी मार्गदर्शन",
    "15/-",
  ),
  TableData(
    "कुटुंबव्यवस्था",
    "प्राचार्यांनी विविध ग्रंथातून मांडलेल्या विचाराच्या आधाराने",
    "20/-",
  ),
  TableData(
    "खरा ब्राह्मण",
    "प्राचार्यांनी विविध ग्रंथातून मांडलेल्या विचाराच्या आधाराने",
    "10/-",
  ),
  TableData(
    "हिंदू धर्म समजून घ्या",
    "हिंदू धर्माचे प्राचीनत्व आणि त्यांची वैशिष्ट्ये यांचे सोदाहरण विवेचन. हिंदूधर्मासंबंधीचा एक संग्राह्य ग्रंथ.",
    "30/-",
  ),
  TableData("गंगालहरी (मूलमात्र)", "श्रीजगन्नाथ पंडित विरचित गंगालहरी", "05/-"),
  TableData(
    "गंगालहरी (गंगातीरविहारिणी)",
    "श्री राम पिंगळीकरकृत वृत्तबध्द मराठी अनुवादासह प्राचार्यांनी वरील कव्याचा भावानुसारी क्रम लावून केलेला अनुवाद",
    "30/-",
  ),
  TableData(
    "ताटीचे अभंग",
    "रुसलेल्या, दार बंद करुन बसलेल्या ज्ञानेश्वरांना दार उघउण्यासाठी विनंती करणारे मुक्ताबाईच्या अभंगावरील भाष्य",
    "50/-",
  ),
  TableData(
    "निर्वाणषटकम्",
    "आद्य शंकराचार्यांच्या निर्वाणषटकावरील विवेचन",
    "15/-",
  ),
  TableData(
    "पूर्वरंग तरंग",
    "कीर्तनातील पूर्वरंगाच्या पदांवरील मनोज्ञ विवरण",
    "60/-",
  ),
  TableData(
    "पूर्वरंग तरंगिणी",
    "कीर्तनातील पूर्वरंगाच्या पदांवरील मनेाज्ञ विवरण",
    "75/-",
  ),
  TableData(
    "ब्रह्मसूत्रार्थ दर्शिनी",
    "ब्रह्मसूत्रांवरील प्रचलित भाषेत लिहिलेले प्राचार्यांचे ओवीबध्द भाष्य",
    "700/-",
  ),
  TableData(
    "भगवान् श्रीकृष्ण - एक दर्शन",
    "सध्य:स्थितीचा परामर्श घेत भगवान् श्रीकृष्णाच्या राजनीतीचे दर्शन घडवणारा मौलिक ग्रंथ",
    "200/-",
  ),
  TableData(
    "भजगोविंदम्",
    "श्रीमद्शंकराचार्यांच्या रचनेवरील प.पू.स्वामींचे प्रवचन",
    "30/-",
  ),
  TableData(
    "भावमुक्तावली (आवृत्ति १५ वी)",
    "प. पू. स्वामी वरदानंदभारती यांच्या आरती-प्रार्थनेसह संपादित केलेली आवृत्ति",
    "15/-",
  ),
  TableData(
    "भावार्चना",
    "पू. अप्पांच्या अध्यात्मिक विकासावर प्रकाश टाकणाऱ्या, निसर्गवर्णने, राष्ट्रभक्ती, देशप्रेम इत्यादी विविधांगांनी नटलेल्या अनेक भावपूर्ण कविता",
    "110/-",
  ),
  TableData(
    "भावानुवाद",
    "संस्कृत स्तोत्रे, आरत्या, इ.चा पू. अप्पांनी केलेला ओवीबद्ध मराठी अनुवाद",
    "20/-",
  ),
  TableData(
    "मनुस्मृति भूमिका",
    "मनुस्मृतितील सर्वच विषयांचा सुंदर परामर्श घेणारी स्वामीजींची भूमिका",
    "50/-",
  ),
  TableData(
    "मनोबोध (विषयानुक्रमणिकेसह)",
    "श्रीसमर्थ रामदासस्वामींच्या “मनांचे श्लोक” या प्रकरणावरील अत्यंत सोपे व उद्बोधक पू.अप्पांचे गद्य विवेचन",
    "300/-",
  ),
  TableData(
    "महाभारताचे वास्तव दर्शन",
    "महाभारतातील थोर व्यक्तीरेखांचे चारित्र्यहनन करणाऱ्या आक्षेपांच्या संदर्भात खंडनात्मकरीत्या महाभारतातील घटनांचे वास्तव दर्शन घडवणारा ग्रंथ",
    "250/-",
  ),
  TableData("मायावाद व चिव्दिलासवाद", "या विषयावरील काही शंकाचे निरसन", "25/-"),
  TableData(
    "यक्षप्रश्न",
    "महाभारतातील यक्षप्रश्न या महत्वाच्या प्रकरणावरील विवेचन",
    "60/-",
  ),
  TableData(
    "राष्ट्रसंरक्षण पोवाडा",
    "हिंदूच्या अवनतीची मीमांसा करणारा व राष्ट्रीय समस्यांचा आढावा घेऊन उपाय सांगणार पोवाडा",
    "स्वेच्छा मूल्य",
  ),
  TableData(
    "रुक्मिणी स्वयंवर (ओवीबध्द)",
    "देवी रुक्मिणीच्या विवाह प्रसंगाचे वर्णन",
    "25/-",
  ),
  TableData(
    "श्रीरुक्मिणीस्वयंवर",
    "देवी रुक्मिणीच्या विवाह प्रसंगाचे कीर्तनोपयोगी आख्यान",
    "25/-",
  ),
  TableData(
    "विराण्या",
    "श्रीसंत तुकाराम महाराजांच्या मधुराभक्ती सूचित करणाऱ्या अभंगावरील रसाळ विवरण",
    "10/-",
  ),
  TableData(
    "श्रीअनुवाद ज्ञानेश्वरी (नित्यपाठ)",
    "अनुवाद ज्ञानेश्वरी ग्रंथातील निवडक ओव्या",
    "12/-",
  ),
  TableData(
    "श्रीकृष्णकथामृत",
    "भगवान् श्रीकृष्णांच्या चरित्रावरील पादाकुलक वृत्तातील अठरा सर्गाचे महाकाव्य",
    "250/-",
  ),
  TableData(
    "श्रीमनुस्मृति (सार्थ - सभाष्य)",
    "संपूर्ण मनुस्मृतीचा श्लोकानुरोधाने स्वामीजींनी केलेला मराठी अनुवाद. याशिवाय निरनिराळे सामाजिक ज्वलंत विषय, ज्वलंत प्रश्नांची मीमांसा करणारी भूमिका व संदर्भ परिशिष्टे",
    "700/-",
  ),
  TableData("गीताप्रवेश", "श्रीमद्भगवद्गीता अध्याय पहिला", "60/-"),
  TableData("स्थितप्रज्ञयोग", "श्रीमद्भगवद्गीता अध्याय दुसरा", "75/-"),
  TableData("कर्मयोग", "श्रीमद्भगवद्गीता अध्याय तिसरा", "160/-"),
  TableData("ज्ञानकर्मसंन्यासयोग", "श्रीमद्भगवद्गीता अध्याय चवथा", "80/-"),
  TableData("कर्मसंन्यासयोग", "श्रीमद्भगवद्गीता अध्याय पाचवा", "60/-"),
  TableData("आत्मसंयमयोग", "श्रीमद्भगवद्गीता अध्याय सहावा", "200/-"),
  TableData("ज्ञानविज्ञानयोग", "श्रीमद्भगवद्गीता अध्याय सातवा", "125/-"),
  TableData("अक्षरब्रह्मयोग", "श्रीमद्भगवद्गीता अध्याय आठवा", "50/-"),
  TableData("राजयोग", "श्रीमद्भगवद्गीता अध्याय नववा", "60/-"),
  TableData("विभूतियोग", "श्रीमद्भगवद्गीता अध्याय दहावा", "45/-"),
  TableData("विश्वरुपदर्शनयोग", "श्रीमद्भगवद्गीता अध्याय अकरावा", "50/-"),
  TableData("भक्तियोग", "श्रीमद्भगवद्गीता अध्याय बारावा", "160/-"),
  TableData("तत्वविज्ञान", "श्रीमद्भगवद्गीता अध्याय तेरावा", "100/-"),
  TableData("गुणत्रयविभागयोग", "श्रीमद्भगवद्गीता अध्याय चौदावा", "150/-"),
  TableData("पुरुषोत्तमयोग", "श्रीमद्भगवद्गीता अध्याय पंधरावा", "50/-"),
  TableData("दैवासुरसंपव्दिभागयोग", "श्रीमद्भगवद्गीता अध्याय सोळावा", "50/-"),
  TableData("श्रध्दात्रयविभागयोग", "श्रीमद्भगवद्गीता अध्याय सतरावा", "80/-"),
  TableData("जीवनसाधना", "श्रीमद्भगवद्गीता अध्याय आठरावा", "175/-"),
  TableData("श्रीविष्णुसहस्रनाम स्तोत्र", "केवळ पाठसंहिता", "10/-"),
  TableData(
    "श्रीविष्णुसहस्रनाम (सार्थ)",
    "श्रीविष्णुसहस्रनामाचे – सोप्या भाषेत केलेले अर्थ विवरण, उत्तम प्रस्तावना तसेच जपव्रत पूर्वांड्ग आणि फलश्रुति यांचे सार्थ विवरण",
    "60/-",
  ),
  TableData(
    "श्रीसद्गुरु षोडशोपचार पूजा (ओवीबद्ध)",
    "श्री. अ.दा.आठवले यांनी श्रीसद्गुरु दासगणू महाराजांची केलेली यथासांग षोडशोपचार पूजा",
    "10/-",
  ),
  TableData("शिवमहिम्नस्तोत्र", "स्तोत्राचा ओवीबध्द अनुवाद", "20/-"),
  TableData("साधक साधना", "साधन चतुष्टयाचे सविस्तर विवरण", "175/-"),
  TableData(
    "साधकाची चिंतनिका",
    "श्रीशंकराचार्यांच्या ‘ते धन्या: # चित्तप्रसाद आणि प्रात:स्मरण’ प्रकरणावरील विवेचन",
    "15/-",
  ),
  TableData(
    "स्वराज्याचा पोवाडा",
    "स्वातंत्र्यानंतर २७ वर्षाच्या सामाजिक परिस्थितीचे वास्तव वर्णन",
    "05/-",
  ),
  TableData("संघप्रार्थना", "रा.स्व.संघप्रार्थनेचे सार्थ स्पष्टीकरण", "40/-"),
  TableData(
    "संतकवी श्रीदासगणू महाराज – चरित्र आणि काव्य विवेचन",
    "श्रीसद्गुरू दासगणू महाराजांचे जीवन चरित्र असलेला ग्रंथ. श्री महाराजांच्या हयातीतच या ग्रंथाचे पुण्यात प्रकाशन झाले होते.",
    "300/-",
  ),
  TableData(
    "वाटा आपल्या हिताच्या (प्रश्नोत्तर रुप)",
    "युवकांकडून विचारल्या जाणाऱ्या सांस्कृतिक, धार्मिक आणि सामाजिक प्रश्नांची पू.अप्पांनी दिलेली सखोल अभ्यासपूर्ण उत्तरे",
    "200/-",
  ),
  TableData(
    "श्रीआत्माराम",
    "श्री रामदास स्वामींच्या 'श्रीआत्माराम' या ग्रंथावरील भाष्य",
    "120/-",
  ),
  TableData(
    "श्रीसिद्धांतलेशसंग्रह",
    "श्री अप्पय्य दीक्षित कृत \"सिद्धांतलेशसंग्रह\" या ग्रंथावरील टीका",
    "300/-",
  ),
];
