import 'package:flutter/material.dart';
import 'package:varadvani/presentation/widgets/custom_app_bar.dart';
import 'package:varadvani/presentation/widgets/widget_helper.dart';
import 'package:varadvani/theme/color_code.dart';

class CharitraScreen extends StatelessWidget {
  const CharitraScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: CustomAppBar(title: 'संक्षिप्त चरित्र'),
      body: SingleChildScrollView(
        child: SafeArea(
          child: Padding(
            padding: const EdgeInsets.only(
              right: 20,
              left: 20,
              top: 10,
              bottom: 15,
            ),
            child: Column(
              spacing: 15,
              children: [
                WidgetHelper.buildStartText(),
                WidgetHelper.buildNormalText(
                  'महाराष्ट्रातील सुप्रसिद्ध संतकवी श्री दासगणू महाराज (श्री गणेश दत्तात्रय सहस्रबुद्धे) साक्षात्कारी संत होते. आधुनिक काळात सकल संतांचे ते उत्तराधिकारी होते असे म्हणणे उचित ठरेल. त्यांनी आपल्या भक्तीरसप्रधान अशा कीर्तनांनी व संतचरित्रात्मक वाङ्मयाने मराठी साहित्यात मोलाची भर घातली. त्या संत दासगणू महाराजांचे उत्तराधिकारी, त्यांचे शिष्योत्तम, मौलिक वाङ्मय निर्माते, आदर्श कीर्तनकार, तत्त्वज्ञ आणि थोर समाजहितैषी असे प्राचार्य अनंत दामोदर आठवले यांचेच संन्यासोत्तर नामकरण “स्वामी वरदानंद भारती” झाले. त्यांचा व त्यांच्या वाङ्मयाचा संक्षेपात परिचय येथे देत आहोत.',
                ),
                WidgetHelper.buildCard(
                  ClipRRect(
                    borderRadius: BorderRadius.only(
                      topRight: Radius.circular(13),
                      bottomLeft: Radius.circular(13),
                      bottomRight: Radius.circular(13),
                    ),
                    child: Image.asset(
                      width: double.infinity,
                      'assets/image/appa3.jpg',
                      fit: BoxFit.fitWidth,
                    ),
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'श्री. अनंतराव यांचे वडील श्री. दामोदर वामन आठवले यांना प्रसंगविशेषाने त्यांच्या वयाच्या १२ व्या वर्षापासून पू. दादांनी (संत दासगणूंनी) सांभाळले. ते उत्तम गायक होते. संस्कृतचा व्यासंग केलेले होते. त्यांनी कीर्तनसेवाही केली. या गुणज्ञपुत्राचा विवाह संत दासगणू महाराजांनी १९१४ साली चि. सौ. कां. कमला महाबळ हिचेशी केला. लग्नानंतर तिचे नाव राधा ठेवले. त्यावेळी दासगणू महाराजांच्या मार्गदर्शक गुरूंच्या श्री साईनाथांच्या (शिर्डीकर) सान्निध्यात मंगल कार्य झाले. त्यांचे सुपुत्र हे अनंतराव आठवले! त्यांचा जन्म शके १८४२, अनंतचतुर्दशी (दि. २७.०९.१९२०) या तिथीला पुण्यात शनिवार पेठेत झाला.',
                ),
                WidgetHelper.buildNormalText(
                  'दुर्दैवाने श्री. अनंतरावांचे पितृछत्र ते ४-५ वर्षांचे असतानाच हरपले. दामूचे लग्नकार्य झाले, त्याचे अंगचे गुण पाहता, आता आपली परंपरा तो उत्तमपणे सांभाळील या कल्पनेत श्री दासगणू महाराज असतानाच हा आघात झाला आणि राधाबाईंचा मोडलेला संसार सांभाळून तडीला लावण्याचे दायित्व श्री महाराजांनी स्वीकारले. “अंतस्त्यागी बहि:संगी लोके विहर” या न्यायाने ते वागले आणि अनंतराव, त्यांच्या दोन बहिणी व माता राधाबाई यांचा सांभाळ सर्वतोपरी श्री दासगणू महाराजांनी केला. वयाच्या १५-१६ वर्षापर्यंत श्री अनंतराव बऱ्याच वेळा विषमज्वराने आजारी पडल्याने प्रकृतीने बेताचेच होते. अशा प्रत्येक दुखण्यात त्यांचे जवळ श्री महाराज बसत व विष्णुसहस्रनामाचे पाठ म्हणत. श्री अनंतरावांनी पुढे एके ठिकाणी, “मी बरेचदा आजारी पडलो हे माझे भाग्यच ! कारण माझ्या सदगुरूंचा कोमल स्पर्श सातत्याने मला लाभला” असे म्हटले आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'संत दासगणू महाराजांनीच त्यांचे लौकिक व अध्यात्मिक शिक्षण केले. श्री अनंतराव पंढरपुरातच महाराजांजवळ लहानाचे मोठे झाले. श्री अनंतरावांची बुद्धिमत्ता विलक्षण होती. पाठांतर उत्तम होते. स्मरणशक्तीही दांडगी होती. एकदा वाचलेलेही पाठ होत असे. घरचे सारे संस्कार धार्मिक होते. त्यांच्या कीर्तनांचा शुभारंभ १९३६ मध्ये वारकऱ्यांचे अध्वर्यू श्री केशवराव देशमुखांच्या उपस्थितीत झाला. १९४० साली श्री अनंतराव मॅट्रिकची परीक्षा उत्तीर्ण झाले आणि महाराजांच्या इच्छेलाच प्राधान्य देऊन ते पुण्यातील आयुर्वेद महाविद्यालयात दाखल झाले. १९४१ च्या फेब्रुवारीत पंढरीतच चतुर्भुज होवून सौ. इंदिराबाईंशी विवाहबद्ध झाले.',
                ),
                WidgetHelper.buildNormalText(
                  'स्वातंत्र्यवीर सावरकरांच्या सक्रीय राजकारणात सहभागी होण्याची त्यांची विशेष इच्छा महाराजांनी अमान्य केली. मात्र याचा कोणताही विपरीत परिणाम श्री. अनंतरावांच्या मनावर झाला नाही. सावरकरांच्या वाङ्मयाचा-व्याख्यानांचा परिणाम म्हणता येईल व संत दासगणूंचे मन मोडणार नाही यादृष्टीने श्री अनंतरावांनी स्वातंत्र्याची प्रेरणा देणारे महाकाव्य “शालिवाहन” निर्माण केले. काही कारणांनी ते पुरे झाले नाही पण त्या १५-१६ सर्गांमधून श्री अनंतरावांच्या अफाट वाचनाची-प्रतिभेची कल्पना येते. १९४४ साली ते आयुर्वेद विशारद झाले. पुढे त्यांनी महाराजांच्या आज्ञेने आणि टिळक आयुर्वेद महाविद्यालयाच्या प्राचार्यांच्या (श्री. मामा गोखले) इच्छेने पारंगतचा पदव्युत्तर अभ्यासक्रम प्रविण्यांकाने पूर्ण केला. १९४२ मध्येच “त्रिदोषांची तर्कशुद्धता” हा मौलिक विषय निबंधातून लिहिला जो आयुर्वेद जाणकारांनी प्रशंसिला होता. पुढे पारंगत झाल्यावर त्याच आयुर्वेद महाविद्यालयात प्राध्यापक ते प्राचार्य अशी पदे त्यांनी भूषविली. ते राष्ट्रीय शिक्षण मंडळाचे सदस्यही होते. त्यांनी सुमारे ४-५ हजार पृष्ठांचे आयुर्वेदीय वाङ्मय निर्मिले. त्यांच्या तर्कपद्धती, कुशल अध्यापन, चिकित्साकौशल्य या गुणांची सर्वांवर छाप पडे. प्रशासकीय दायित्वही त्यांनी कौशल्याने निभावले. आयुर्वेदाशी ते एकनिष्ठ होते. रसशाळा, महाविद्यालय आणि ताराचंद धर्मार्थ रुग्णालय या सर्वांचे दायित्व सांभाळिले. संस्थेच्या नियामक मंडळातील वाद पुढे विकोपाला जाऊन आयुर्वेदाशी प्रतारणा होण्याचा संभव दिसताच त्यांनी संस्थेचे त्यागपत्र दिले. १९५० ते १९६६ असा सोळा वर्षांचा काळ त्यांनी संस्थेत व्यतीत केला होता. या काळात त्यांचा प्रपंचही नेटकेपणाने झाला. त्यांना पहिला मुलगा झाला परंतु दुर्दैवाने तो अल्पायु ठरला. पुढे त्यांना ईशकृपेने तीन कन्यांची व दोन पुत्रांची प्राप्ती झाली. मुली सुस्थळी पडल्या. मुलगेही आपापल्या कार्यात कार्यमग्न झाले.',
                ),
                WidgetHelper.buildNormalText(
                  'पन्नास-साठच्या दशकात त्यांचे आयुर्वेदाविषयी व त्या कार्यक्षेत्रातले पितृतुल्य मार्गदर्शक वैद्य श्री. मामा गोखले आणि संत दासगणू महाराज यांचा वियोग अनंतरावांना घडला. १९४९ मध्ये गुरूंच्या आज्ञेने “श्रीकृष्णकथामृत” हे महाकाव्य “दोहाचौपाई” या तुलसीदासांच्या रामायणाच्या धर्तीवर निर्माण केले. सद्गुरुंच्या चरित्र व वाङ्मयाचा परिचय समाजाला घडविला. संत दासगणूंची अलौकिक गुणवत्ता, त्यांचे मोठेपण व त्यांचे भक्तीरसप्रधान काव्य अनंतरावांमुळेच सर्वांना समजू शकले. सद्गुरूंच्या निर्वाणानंतर त्यांचे समग्र वाङ्मयाही दहा खंडांत प्रसिद्ध केले. अनंतरावांचा साक्षेप फार मोठा म्हणूनच हे शक्य झाले.',
                ),
                WidgetHelper.buildNormalText(
                  'इ. स. १९६६ नंतर नोकरीचे बंधन नसल्याने संत दासगणूंच्या विशाल परिवाराच्या कामासाठी श्री अनंतरावांनी वाहून घेतले. १९६८ मध्ये संत दासगणूंची जन्मशताब्दी साजरी केली. नांदेड जवळील गोरटे या गावात विश्रांतीसाठी संत दासगणू जात. या गावीच श्रीदासगणू महाराजांच्या अनेक ज्येष्ठ भक्तांच्या आग्रहाखातर श्रीमहाराजांची वस्त्रसमाधी अनंतरावांनी निर्माण केली आणि “श्री दासगणू महाराज प्रतिष्ठान, गोरटे” ही संस्था निर्माण करून ती १९७४ मध्ये नोंदणीकृत केली.',
                ),
                WidgetHelper.buildNormalText(
                  'आता श्री अनंतरावांचे “गुरुपरंपरा रक्षण” हे ध्येय ठरले आणि त्या अनुषंगाने संस्कृतीसंरक्षण व तीवरील आक्षेपांचे निराकरण यासाठी कीर्तने, प्रवचने, व्याख्याने, शिबिरे, परिसंवाद, भेटीगाठी ही साधने ठरली आणि अनुस्यूतपणे लोकजागृती करणे हेही ध्येयच बनले. यासाठी “श्री दासगणू महाराज प्रतिष्ठान” भाविकांचे श्रद्धाकेंद्र आणि साधनाकेंद्र निर्माण झाले.',
                ),
                WidgetHelper.buildNormalText(
                  'गुरुपदाची धुरा वाहायची तर अध्यात्मिक अधिकार वाढविला पाहिजे म्हणून त्यांनी नोकरीत असल्यापासूनच अध्यात्मिक साधना केली. त्यांनीच एके ठिकाणी व्यक्त केल्याप्रमाणे विष्णुसहस्रनामाची साधना त्यांनी केली. श्री महाराज गेल्यानंतर ते नियमाने हिमालयात जाऊ लागले. त्यांचे ते एकांतसेवन या दृष्टीने फार महत्वाचे आहे. श्रावण वद्य एकादशी, शके १८९३, सोमवार, दि.१६/०८/१९७१ या दिवशी पहाटे ब्रह्ममुहूर्ताच्या वेळी त्यांना श्री नारायणाचा साक्षात्कार झाला. त्यांचा तो अनुभव त्यांनी रूपकात्मकतेने कवितेतून व्यक्त केला आहे. त्यांच्या लहानमोठया अनेक कविता आहेत. सुरुवातीला “भावार्चना” या छोटया पुस्तकात त्या प्रकाशित झाल्या आहेत. ते स्वतः कमालीचे प्रसिद्धी पराङ्मुख असल्याने फार उशीरा “भावार्चने” ची द्वितीयावृत्ती १९९४मध्ये प्रकाशित झाली. श्री नारायणाच्या साक्षात्कारानंतर ते संन्यस्त वृत्तीने प्रपंचात राहिले. प्रपंच नेटका केला पण त्यात कुठे आसक्त झाले नाहीत. १९९० मध्ये त्यांच्या मातोश्रींच्या निर्याणानंतर त्यांनी उत्तरकाशी येथे स्वामी विद्यानंदगिरी यांच्याकडून १९९१ मध्ये विधिवत संन्यास दीक्षा घेतली! आता ते “स्वामी वरदानंद भारती” झाले! संत दासगणूंची संन्यास घेण्याची इच्छा त्यांच्या या शिष्योत्तमाने अशी पूर्ण केली !!',
                ),
                WidgetHelper.buildNormalText(
                  '“ब्राह्मणु हिंडता बरा” या समर्थवचनाप्रमाणे, समर्थांप्रमाणे, स्वामीजींनी तीन वेळा भारत भ्रमण केले. ध्येयासक्त जीवनाला पूरक ठरेल असे वाङ्मय निर्माण केले. काही ज्येष्ठ भक्तांनी वाङ्मयाचे प्रकाशन नीटपणे होण्यासाठी १९८२ मध्ये “श्री राधादामोदर प्रतिष्ठान” ही संस्था निर्माण केली व त्या संस्थेकडून स्वामीजींचे अनेक ग्रंथ प्रकाशित झाले आहेत.',
                ),
                WidgetHelper.buildNormalText(
                  'महर्षी व्यास निर्मित “ब्रह्मसूत्रे” हा प्रस्थानत्रयीतील मुख्य ग्रंथ! स्वामीजींनी ७-८ हजार ओव्या रचून ”ब्रह्मसूत्रार्थदर्शिनी” ग्रंथ सिद्ध केला. ”उपनिषदर्थ कौमुदी” नावाने सर्व प्रधान १० उपनिषदांवर भाष्य केले. विशेष म्हणजे श्रीनारायण व श्वेताश्वेतर उपनिषदांवरही लेखन केले. हे उपनिषद् वाङ्मय ५ खंडात प्रसिद्ध असून पाचव्या खंडात उपनिषद् वाङ्मयावरील जाणकारांच्या सुमारे ५०-६० प्रश्नांची उत्तरे ग्रथित केली आहेत. श्रीमद्भगवद्गीतेच्या प्रत्येक अध्यायावर स्वामीजींनी विवरण केले आहे व त्याचे अठरा अध्यायही प्रसिद्ध झाले आहेत.',
                ),
                WidgetHelper.buildNormalText(
                  '“महाभारताचे वास्तव दर्शन” हा ग्रंथ आणि पू. अप्पांची (श्री अनंतरावांची) त्यावरील व्याख्याने ही महाराष्ट्रात सर्वदूर गाजली. आधुनिक साहित्यिकांनी महाभारतातील कथांचे विकृतीकरण आणि थोर व्यक्तिरेखांचे चारित्र्यहनन करून जे ग्रंथ छापले होते त्यांचे साधार खंडन आपल्या व्याख्यानातून व या ग्रंथातून त्यांनी केले. युवकांना भेडसावणाऱ्या सांस्कृतिक, धार्मिक आणि सामाजिक प्रश्नांना दिलेली उत्तरे असलेला असाच दुसरा “वाटा आपल्या हिताच्या” हा ग्रंथ. यातील नुसते प्रश्न जरी पाहिले तरी ग्रंथाचा दर्जा लक्षात येतो. “मनाचे श्लोक” हे समर्थांचे एक छोटेसे प्रकरण. समर्थांचे सर्व सामर्थ्य जणू त्यात प्रकटले आहे. त्या ग्रंथावरील प्रवचने पू. अप्पांनी केली होती. त्या प्रवचनांचे ग्रंथरूप म्हणजे त्यांचा “मनोबोध” हा ग्रंथ! आज या ग्रंथांची अकरावी आवृत्ती प्रसिद्ध झाली आहे, इतका तो लोकप्रिय ग्रंथ आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'तत्वज्ञानाचा व्यवहार विशद करणारा “साधक-साधना” ग्रंथ असाच मौलिक आहे. “भगवान श्रीकृष्ण - एक दर्शन” मध्ये कृष्णाची राजनीती व धर्मसंस्थापनेसाठी त्यांचे प्रयत्न हाच विषय आहे. कर्मयोग, आत्मसंयमयोग, जीवनसाधना इ. श्रीगीतेच्या १८ अध्यायावरील त्यांची लोकप्रिय पुस्तके. त्यांच्या एका चाहत्याने “ज्ञानेश्वरी” कळत नाही, तुम्ही काहीतरी सोपी करून सांगा असा फार आग्रह केला. पू. अप्पांनी ते मनावर घेतले नि ४-५ महिन्यात समओवी - “अनुवाद ज्ञानेश्वरी” सिद्ध केली. मूळ ९०३३ ओव्यांचे रुपांतर अवघ्या दहा हजार प्रचलित मराठी भाषेतील ओव्यात केले. म्हणून तो समओवी अनुवाद !',
                ),
                WidgetHelper.buildNormalText(
                  'याशिवाय लहानमोठे प्रकरण ग्रंथ आहेतच. निर्याणापूर्वी त्यांनी ११०० पृष्ठांचा “मनुस्मृती (सार्थ-सभाष्य)” हा ग्रंथ सिद्ध केला. त्यात आधुनिकांच्या सर्व प्रश्नांची उत्तरे म्हणून मनुस्मृतीची “भूमिका” लिहिली ती ९८ पृष्ठांची. नंतर आजच्या आक्षेपांच्या संदर्भात मनुस्मृतीचा प्रत्येक श्लोक सार्थ लिहिला आणि आपल्या खंडन-मंडनाप्रीत्यर्थ उपयुक्त असे पुरावे शेवटी २७० पृष्ठांत “परिशिष्टे” म्हणून मांडले. प्रामाणिक अभ्यासक, तो विरोधक असला तरी, या ग्रंथाबाबत असे म्हणेल की “Came to scoff but remained to pray” ! असा हा मौलिक ग्रंथ आहे. थोडक्यात सांगायचे म्हणजे स्वामीजींचे सुमारे ८० चे वर ग्रंथ प्रकाशित आहेत. या सा-या वाङ्मयात त्यांचे राष्ट्रचिंतनही उत्कटपणे व्यक्त झालेले आहे.',
                ),
                WidgetHelper.buildNormalText(
                  'सततोद्योगी असे हे व्यक्तिमत्व मनुस्मृती लिखाणानंतर उत्तरकाशीला गेले. निर्याणाचा दिवस नक्की केला. दोन दिवस आधी कैलासाश्रमाचे व्यवस्थापक श्री. उमानंद स्वामीजींना थोडी कल्पना दिली होती. श्रावण वद्य एकादशी, शके १९२४, मंगळवार, दि.०३/०९/२००२ या दिवशी स्वामीजी गंगास्नानार्थ गेले. परत आल्यावर परिवारातील व्यक्तींना म्हणाले, आता मी बंद केलेले दार चार तासापर्यंत उघडू नका. आत गेल्यावर काही आन्हिके केली व सिध्दासन घालून आसनस्थ झाले. ४ तासानंतर परिवारातल्या व्यक्ती आत गेल्या तो त्यांना दिसले, देवघरात स्वामीजी उजव्या हाताने नारायणाचे पाय धरून आहेत, मस्तक विनम्र आहे व डावा हात कमंडलूवर स्थित आहे. ते पाहताच त्यांना काय झाले आहे याची कल्पना आली. प्रमुख संन्याशांना बोलावून त्यांच्या सहाय्याने त्यांनी स्वामीजींना देवघरातून बाहेर आणून झोपविले. पू. स्वामीजी त्यानंतर ४४-४५ तास श्वसन करीत होते. मात्र अन्य कोणतीही प्रतिक्रिया-प्रतिसाद नव्हता. श्रावण वद्य त्रयोदशी, शके १९२४, गुरुवार, दि. ०५/०९/२००२ या दिवशी पहाटे ब्रह्ममुहूर्तावर (सकाळी साडेपाच वाजता) त्यांनी अंतिम श्वास घेतला आणि ते श्रीनारायणाच्या चरणी विलीन झाले.',
                ),
                WidgetHelper.buildNormalText(
                  'समाधीला बसण्यापूर्वी पत्रे-संदेश इ. लेखन केलेले कागद तेथे होते. त्यातील संदेशात ते म्हणतात -',
                ),
                Text(
                  'मी म्हणजे ना शरीर l मी मद्ग्रंथांचा संभार ll \nत्याचे वाचन चिंतन l यथाशक्ती आचरण ll \nहीच गुरुपूजा खरी l नीट धरावे अंतरी ll',
                  textAlign: TextAlign.center,
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
                WidgetHelper.buildNormalText(
                  'याशिवाय अन्यही वर्णन त्या अंतिम कवितेत आहे. ही त्यांची संजीवन समाधी जनमानसाला थक्क करणारी होती. त्यांच्या इच्छेप्रमाणेच त्यांचे पार्थिव गंगार्पण करण्यात आले (०६.०९.२००२ रोजी).',
                ),
                Text(
                  'मन, वाणी, बुद्धी ही श्रमली देश हितार्थासी l \nसंस्कृती संरक्षणार्थ बनले योध्दा संन्यासी ll \nधर्माचरणी निरपवाद जणू गांगेयची सार्थ l \nयथार्थ आचरणे जिंकियले चारही पुरुषार्थ ll',
                  style: TextStyle(
                    fontSize: 18,
                    fontFamily: 'Mukta',
                    fontWeight: FontWeight.bold,
                    color: Color(ColorCode.black),
                    letterSpacing: 0,
                    height: 1.5,
                  ),
                ),
              ],
            ),
          ),
        ),
      ),
    );
  }
}
